Repository: KDE/kdb
Catalog: poqm/*/kdb_qt.po
Languages: ar, az, el, eo, et, eu, ka, ru, sl, zh_tw

# KDbParser|
source: Error near "%1".
ar: خطأ قرب «%1».
az: "%1" yaxınlığındakı xəta
el: Σφάλμα κοντά στο «%1».
eo: Eraro proksime de "%1".
et: Tõrge "%1" lähedal.
eu: Errorea "%1" ondoan.
ka: შეცდომა `%1' -სთან ახლოს.
ru: Ошибка вблизи «%1».
sl: Napaka pri "%1".
zh_tw: 於「%1」附近的錯誤。

# KDbParser|
source: Other error
ar: خطأ آخر
az: Digər xəta
el: Άλλο σφάλμα
eo: Alia eraro
et: Muu tõrge
eu: Beste errore bat
ka: სხვა შეცდომა
ru: Другая ошибка
sl: Ostala napaka
zh_tw: 其他錯誤

# KDbParser|
source: Implementation error
ar: خطأ في التنفيذ
az: Tətbiq edilmə xətası
el: Σφάλμα υλοποίησης
eo: Eraro de efektivigo
et: Teostuse viga
eu: Inplementazio errorea
ka: განხორციელების შეცდომა
ru: Ошибка реализации
sl: Napaka izvedbe
zh_tw: 實作錯誤

# KDbParser|
source: No query statement specified.
ar: لم يحدد عبارة استعلام.
az: Sorğu təlimatı göstərilməyib
el: Δεν ορίσθηκε ερώτημα.
eo: Neniu demanda deklaro specifita.
et: Päringulauset pole määratud.
eu: Ez da itaun adierazpenik zehaztu.
ka: მოთხოვნის ოპერატორი მითითებული არაა.
ru: Не указано выражение запроса.
sl: Stavek poizvedbe ni določen.
zh_tw: 未指定查詢敘述。

# KDbParser|
source: Unexpected character.
ar: حرف غير متوقع.
az: Qeyri-müəyyən işarə
el: Μη αναμενόμενος χαρακτήρας.
eo: Neatendita signo.
et: Ootamatu märk.
eu: Ustekabeko karakterea.
ka: მოულოდნელი სიმბოლო.
ru: Неожиданный символ.
sl: Nepričakovan znak.
zh_tw: 未預期的字元。

# KDbParser|
source: "*" could not be used if no tables are specified.
ar: لا أستطيع استخدام «*» إذا لم تحدد جداول.
az: Əgər cədvəl göstərilməyibsə "*" istifadə oluna bilməz.
el: Αδυναμία χρήσης του «*» αν δεν ορισθούν πίνακες.
eo: "*" ne povus esti uzata se neniuj tabeloj estas specifitaj.
et: "*" ei saa kasutada, kui tabelit ei ole määratud.
eu: «*» ezin da erabili taularik zehazten ez bada.
ka: თუ ცხრილები მითითებული არაა, "*" არ უნდა გამოიყენოთ.
ru: Нельзя использовать «*», если не указано ни одной таблицы.
sl: "*" ni mogoče uporabiti, če ni podana nobena tabela.

# KDbParser|
source: "*" could not be added.
ar: لا أستطيع إضافة «*».
az: "*" əlavə edilmədi.
el: Αδυναμία προσθήκης «*».
eo: "*" ne povis esti aldonita.
et: "*" ei saa lisada.
eu: «*» ezin izan da gehitu.
ka: "*" დამატება შეუძლებელია.
ru: Нельзя добавить «*».
sl: "*" ni bilo mogoče dodati.

# KDbParser|
source: "<table>.*" could not be added.
ar: لا أستطيع إضافة «<table>.*».
az: "<table>.*" əlavə edilmədi.
el: Αδυναμία προσθήκης του «<table>.*».
eo: "<tabelo>.*" ne povis esti aldonita.
et: "<tabel>.*" ei saa lisada.
eu: "<taula>.*" ezin izan da gehitu.
ka: "<ცხრილი>.*" -ის დამატება შეუძლებელია.
ru: Нельзя добавить «<table>.*».
sl: "<table>.*" ni bilo mogoče dodati.

# KDbParser|
source: Could not add binding to a field.
ar: لا أستطيع إضافة ربط لحقل.
az: Bağlamanı sahəyə əlavə etmək mümkün olmadı.
el: Αδυναμόα προσθήκης δέσμευσης σε πεδίο.
eo: Ne eblis aldoni ligadon al kampo.
et: Väljale ei saa seost lisada.
eu: Ezin izan zaio eremu bati lotura gehitu.
ka: ველზე მიბმის დამატების შეცდომა.
ru: Не удалось добавить привязку к полю.
sl: Polju ni bilo mogoče dodati vezave.

# KDbParser|
source: Table "%1" does not exist.
ar: الجدول «%1» غير موجود.
az: "%1" cədvəli mövcud deyil.
el: Ο πίνακας «%1» δεν υπάρχει.
eo: Tabelo "%1" ne ekzistas.
et: Tabelit "%1" ei ole olemas.
eu: "%1" taula ez da existitzen.
ka: ცხრილი %1 არ არსებობს.
ru: Таблица «%1» не существует.
sl: Tabela "%1" ne obstaja.

# KDbParser|
source: Could not set alias "%1" for table "%2". This alias is already set for table "%3".
ar: لا أستطيع تعيين الاسم المستعار «%1» للجدول «%2». هذا الاسم المستعار معيّن بالفعل للجدول «%3».
az: "%2" cədvəli üçün "%1" ləqəbini ayarlamaq mümkün olmadı. Bu ləqəb artıq "%3" cədvəli üçün təyin olunub.
el: Αδυναμία ορισμού ψευδωνύμου «%1» για τον πίνακα «%2». Αυτό το ψευδώνυμο έχει ήδη ρυθμιστεί για τον πίνακα «%3».
eo: Ne eblis agordi kaŝnomon "%1" por tabelo "%2". Ĉi tiu kaŝnomo jam estas agordita por tabelo "%3".
et: Tabelile "%2" ei saa määrata aliast "%1". See alias on juba määratud tabelile "%3".
eu: Ezin izan zaio ezarri "%1" ezizena "%2" taulari. Ezizen hau dagoeneko ezarri zaio "%3" taulari.
ka: ცხრილისთვის "%2" მეტსახელის "%1" დაყენებბის შეცდომა. ეს მეტსახელი უკვე გამოიყენება ცხრილისთვის "%3".
ru: Не удалось указать псевдоним «%1» для таблицы «%2». Этот псевдоним уже указан для таблицы «%3».
sl: Ni mogoče nastaviti sinonima "%1" za tabelo "%2". Ta sinonim je že dodeljen tabeli "%3".

# KDbParser|
source: Invalid alias definition for column "%1".
ar: تعريف اسم مستعار غير صالح للعمود «%1».
az: "%1" sütunu üçün yalnış ləqəb müəyyən edilməsi.
el: Μη έγκυρος ορισμός ψευδωνύμου για τη στήλη «%1».
eo: Nevalida kaŝnomo por kolumno "%1".
et: Vigane veeru "%1" aliase määrang.
eu: "%1" zutabeko ezizen definizio baliogabea.
ka: არასწორი მეტსახელის აღწერა სვეტისთვის "%1".
ru: Недопустимое определение псевдонима для столбца «%1».
sl: Neveljavna definicija sinonima za stolpec "%1".

# KDbParser|
source: More than one asterisk "*" is not allowed.
ar: لا يسمح بأكثر من علامة نجمية «*» واحدة.
az: Yalnız bir "*" işarəsinə icazə verilir.
el: Δεν επιτρέπονται περισσότεροι του ενός αστερίσκοι «*».
eo: Pli ol unu asterisko "*" ne estas permesitaj.
et: Üle ühe tähekese "*" ei ole lubatud.
eu: Ez da onartzen «*» bat baino gehiago.
ka: ერთზე მეტი ვარსკვლავის "*" მითითება აკრძალულია.
ru: Допускается не более одной звёздочки «*».
sl: Več kot ena zvezdica "*" ni dovoljena.

# KDbParser|
source: Invalid "%1" column definition.
ar: تعريف عمود غير صالح «%1».
az: "%1" sütununun yalnıç müəyyənləşdirilməsi.
el: Μη έγκυρος ορισμός στήλης «%1».
eo: Nevalida "%1" kolumnodifino.
et: Vigane "%1" veeru definitsioon.
eu: "%1" zutabe definizio baliogabea.
ka: არასწორი "%1" სვეტის აღწერა.
ru: Недопустимое определение столбца «%1».
sl: Neveljavna definicija stolpca "%1".

# KDbParser|
source: Could not set alias "%1" for column #%2. This alias is already set for column #%3.
ar: لا أستطيع تعيين الاسم المستعار «%1» للعمود #%2. هذا الاسم المستعار معيّن بالفعل للعمود #%3.
az: #%2 sütunu üçün "%1" ləqəbi təyin olunmadı. Bu ləqəb artıq #%3 sütunu üçün təyin olunub.
el: Αδυναμία ορισμού ψευδωνύμου «%1» για τη στήλη #%2. Αυτό το ψευδώνυμο έχει ήδη ρυθμιστεί για τη στήλη #%3.
eo: Ne eblis agordi kaŝnomon "%1" por kolumno #%2. Ĉi tiu kaŝnomo jam estas agordita por kolumno #%3.
et: Veerule "%2" ei saa määrata aliast "%1" See alias on juba määratud veerule "%3".
eu: Ezin izan zaio ezarri "%1" ezizena %2 zk. zutabeari. Ezizen hau dagoeneko ezarri zaio %3 zk. zutabeari.
ka: სვეტისთვის #%2 მეტსახელის "%1" დაყენების შეცდომა. ეს მეტსახელი უკვე გამოიყენება ცხრილისთვის #%3.
ru: Не удалось указать псевдоним «%1» для столбца #%2. Этот псевдоним уже указан для столбца #%3.
sl: Ni mogoče nastaviti sinonima "%1" za stolpec #%2. Ta sinonim je že dodeljen stolpcu #%3.

# KDbParser|
source: Could not set alias "%1" for column #%2.
ar: لا أستطيع تعيين الاسم المستعار «%1» للعمود #%2.
az: #%2 sütunu üçün "%1" ləqəbi təyin olunmadı.
el: Αδυναμία ορισμού ψευδωνύμου «%1» για τη στήλη #%2.
eo: Ne eblis agordi kaŝnomon "%1" por kolumno #%2.
et: Aliase "%1" määramine veerule nr %2 nurjus.
eu: Ezin izan zaio ezarri "%1" ezizena %2 zk. zutabeari.
ka: სვეტისთვის #%2 მეტსახელის "%1" დაყენების შეცდომა.
ru: Не удалось указать псевдоним «%1» для столбца #%2.
sl: Ni mogoče nastaviti sinonima "%1" za stolpec #%2.

# KDbParser|
source: Could not define sorting. Column at position %1 does not exist.
ar: لا أستطيع تحديد الفرز. العمود في الموضع %1 غير موجود.
az: Çeşidləmə müəyyən olunmadı. %1 mövqeyində sütun yoxdur.
el: Αδυναμία ορισμού ταξινόμησης. Η στήλη στη θέση %1 δεν υπάρχει.
eo: Ne eblis difini ordigon. Kolumno ĉe pozicio %1 ne ekzistas.
et: Sortimist ei saanud määrata. Veergu asukohas %1 ei ole olemas.
eu: Ezin izan da sailkapena definitu. %1 kokapeneko zutabea ez da existitzen.
ka: დალაგების აღწერის შეცდომა. მდებარეობაზე %1 სვეტი არ არსებობს.
ru: Не удалось определить сортировку. Столбца в позиции %1 не существует.
sl: Ni mogoče definirati razvrščanja. Stolpec na položaju %1 ne obstaja.

# KDbParser|
source: Could not define sorting. Column name or alias "%1" does not exist.
ar: لا أستطيع تحديد الفرز. اسم العمود أو الاسم المستعار «%1» غير موجود.
az: Çişidləmə müəyyən olunmadı. "%1" sütun adı və ya ləqəb mövcud deyil.
el: Αδυναμία ορισμού ταξινόμησης. Το όνομα ή ψευδώνυμο «%1» της στήλης δεν υπάρχει.
eo: Ne eblis difini ordigon. Kolumna nomo aŭ kaŝnomo "%1" ne ekzistas.
et: Sortimist ei saanud määrata. Veeru nime või aliast "%1" ei ole olemas.
eu: Ezin izan da sailkapena definitu. "%1" zutabe izena edo ezizena ez da existitzen.
ka: დალაგების აღწერის შეცდომა. სვეტი სახელით ან მეტსახელით %1 არ არსებობს.
ru: Не удалось определить сортировку. Имя или псевдоним столбца «%1» не существует.
sl: Ni mogoče definirati razvrščanja. Ime stolpca ali sinonim %1 ne obstaja.

# KDbObjectNameValidator|
source: Cannot use reserved name "%1" for objects. Please choose another name.
ar: لا أستطيع استخدام الاسم المحجوز «%1» للكائنات. اختر اسمًا آخر.
az: Obyektlər üçün "%1" qorunan adı istifadə oluna bilməz. Başqa ad seçin.
el: Αδυναμία χρήσης του κατοχυρωμένου ονόματος «%1» για αντικείμενα. Επιλέξτε άλλο όνομα.
eo: Ne povas uzi rezervitan nomon "%1" por objektoj. Bonvolu elekti alian nomon.
et: Reserveeritud nime "%1" ei saa objektide puhul kasutada. Palun vali mõni muu nimi.
eu: Ezin da erabili erreserbatutako "%1" izena objektuetarako. Aukeratu beste izen bat.
ka: დარეზერვებულია სახელის "%1" ობიექტებისთვის გამოყენება აკრძალულია. აირჩიეთ სხვა სახელი.
ru: Нельзя использовать зарезервированное имя «%1» для объектов. Выберите другое имя.
sl: Za predmete ni mogoče uporabiti rezerviranega imena "%1". Izberite drugo ime.

# KDbObjectNameValidator|
source: Names of internal database objects start with "kexi__".
ar: أسماء كائنات قاعدة البيانات الداخلية تبدأ بـ «kexi__».
az: Daxili verilənlər bazası adları "kexi__" ilə başlayır.
el: Τα ονόματα των αντικειμένων της εσωτερικής βάσης δεδομένων αρχίζουν με «kexi__».
eo: Nomoj de internaj datumbazaj objektoj komenciĝas per "kexi__".
et: Sisemise andmebaasi objektide nime alguses seisab "kexi__".
eu: Datu-base barneko objektuen izenak horrela hasten dira: "kexi__".
ka: შიდა ბაზების ობიექტების სახელები "kexi__"_ით იწყება.
ru: Имена объектов внутренней базы данных начинаются с «kexi__».
sl: Imena internih predmetov baze podatkov se začnejo z "kexi__".

# KDbSimpleCommandLineApp|
source: Database driver ID
ar: معرِّف مشغل قاعدة البيانات
az: Verilənlər bazası sürücüsü İD-si
el: Αναγνωριστικό οδηγού βάσης δεδομένων
eo: ID de datumbaza pelilo
et: Andmebaasidraiveri ID
eu: Datu-baseko gidari ID
ka: ბაზის დრაივერის ID
ru: Идентификатор драйвера базы данных
sl: ID gonilnika baze podatkov
zh_tw: 資料庫驅動程式 ID

# KDbSimpleCommandLineApp|
source: Database user name
ar: اسم مستخدم قاعدة البيانات
az: Verilənlər bazası istifadəçi adı
el: Όνομα χρήστη βάσης δεδομένων
eo: Datumbaza uzantnomo
et: Andmebaasi kasutajanimi
eu: Datu-baseko erabiltzaile-izena
ka: ბაზის მომხმარებლის სახელი
ru: Имя пользователя базы данных
sl: Uporabniško ime podatkovne baze
zh_tw: 資料庫使用者名稱

# KDbSimpleCommandLineApp|
source: Prompt for password
ar: اطْلب كلمة السر
az: Şifrə tələb olunur
el: Προτροπή για κωδικό πρόσβασης
eo: Peti pasvorton
et: Parooli küsimine
eu: Eskatu pasahitza
ka: პაროლის მოთხოვნა
ru: Запрос пароля
sl: Poziv za geslo
zh_tw: 詢問密碼

# KDbSimpleCommandLineApp|
source: Host (server) name
ar: اسم المضيف (الخادوم)
az: Host (server) adı
el: Όνομα υπολογιστή (εξυπηρετητή)
eo: Gastiganta (servilo) nomo
et: Masina (serveri) nimi
eu: Ostalari (zerbitzari) izena
ka: ჰოსტის სახელი
ru: Имя хоста (сервера)
sl: Ime gostitelja (strežnika)
zh_tw: 主機（伺服器）名稱

# KDbSimpleCommandLineApp|
source: Server's port number
ar: رقم منفذ الخادوم
az: Serverin port nömrəsi
el: Αριθμός θύρας εξυπηρετητή
eo: Porda numero de servilo
et: Serveri pordi number
eu: Zerbitzariko ataka zenbakia
ka: სერვერის პორტის ნომერი
ru: Номер порта сервера
sl: Številka vrat strežnika
zh_tw: 伺服器的連接埠編號

# KDbSimpleCommandLineApp|
source: Server's local socket filename
ar: اسم ملف مأخذ التوصيل المحلي للخادوم
az: Serverin yerli socket fayl adı
el: Όνομα αρχείου τοπικής υποδοχής στον εξυπηρετητή
eo: Loka ingo dosiernomo de servilo
et: Serveri kohaliku sokli failinimi
eu: Zerbitzariaren hartune lokalaren fitxategi-izena
ka: სერვერის ლოკალური სოკეტის ფაილის სახელი
ru: Имя файла локального сокета сервера
sl: Ime datoteke lokalne vtičnice strežnika
zh_tw: 伺服器的本地 socket 檔案名稱

# KDbSimpleCommandLineApp|Enter password for <user>
source: Enter password for %1:
ar: أدخِل كلمة السر لـ %1:
az: %1 üçün şifrəni daxil edin:
el: Δώστε κωδικό πρόσβασης για %1:
eo: Enigu pasvorton por %1:
et: %1 parool:
eu: Sartu %1(e)ko pasahitza:
ka: შეიყვანეთ %1-ის პაროლი:
ru: Укажите пароль для %1:
sl: Vnesite geslo za %1:
zh_tw: 輸入 %1 的密碼：

# KDbValidator|
source: "%1" value has to be entered.
ar: يجب إدخال قيمة «%1».
az: "%1" dəyəri daxil edilməlidir.
el: Η τιμή «%1» πρέπει να εισαχθεί.
eo: "%1" valoro devas esti enigita.
et: "%1" väärtus tuleb sisestada.
eu: "%1" balioa sartu behar da.
ka: "%1"-ის მნიშვნელობა შესაყვანია.
ru: Необходимо указать значение «%1».
sl: Vnesti je treba vrednost "%1".
zh_tw: 必須輸入「%1」數值。

# KDbTableViewData|
source: "%1" column requires a value to be entered.
ar: يتطلب العمود «%1» إدخال قيمة.
az: "%1" sütunu bir dəyər daxil etməyi tələb edir.
el: Η στήλη «%1» απαιτεί τιμή για να εισαχθεί.
eo: La kolumno "%1" postulas enigi valoron.
et: "%1" veerg nõuab väärtuse sisestamist.
eu: "%1" zutabeak balio bat sartzea behar du.
ka: სვეტის "%1" მნიშვნელობის შეყვანა აუცილებელია.
ru: Столбец «%1» требует указания значения.
sl: Stolpec "%1" zahteva vnos vrednosti.
zh_tw: 欄位「%1」必須要有輸入數值。

# KDbTableViewData|
source: The column's constraint is declared as NOT NULL.
ar: قيود العمود معلنة كـ NOT NULL.
az: Sütunların məhdudiyyəti NOT NULL olaraq bildirilir.
el: Ο περιορισμός της στήλης δηλώνεται ως NOT NULL.
eo: La limo de la kolumno estas deklarita kiel NOT NULL.
et: Veeru piiranguks on seatud NOT NULL.
eu: Zutabeko murrizketa EZ NULU gisa deklaratua dago.
ka: სვეტის შეზღუდვა აღწერილია, როგორც NOT NULL.
ru: Поля этого столбца не могут иметь значение NULL.
sl: Omejitev stolpca je določena kot NOT NULL.

# KDbTableViewData|
source: The column's constraint is declared as NOT EMPTY.
ar: قيود العمود معلنة كـ NOT EMPTY.
az: Sütunların məhdudiyyəti NOT EMPTY olaraq bildirilir.
el: Ο περιορισμός της στήλης δηλώνεται ως NOT EMPTY.
eo: La limo de la kolumno estas deklarita kiel NE MALKA.
et: Veeru piiranguks on seatud NOT EMPTY.
eu: Zutabeko murrizketa EZ HUTSIK gisa deklaratua dago.
ka: სვეტის შეზღუდვა აღწერილია, როგორც NOT EMPTY.
ru: Поля этого столбца не могут быть пустыми.
sl: Omejitev stolpca je določena kot NOT EMPTY.

# KDbTableViewData|
source: Record inserting failed.
ar: فشل إدراج السجل.
az: Yazının daxil edilə bilmədi.
el: Αποτυχία εισαγωγής εγγραφής.
eo: Enmetado de rikordo malsukcesis.
et: Kirje lisamine nurjus.
eu: Erregistroa txertatzea huts egin du.
ka: ჩანაწერის ჩასმის შეცდომა.
ru: Не удалось вставить запись.
sl: Vstavljanje zapisa ni uspelo.
zh_tw: 紀錄插入失敗。

# KDbTableViewData|
source: Record changing failed.
ar: فشل تغيير السجل.
az: Yazı dəyişdirilə bilmədi.
el: Αποτυχία αλλαγής εγγραφής.
eo: Rikordŝanĝo malsukcesis.
et: Kirje muutmine nurjus.
eu: Erregistroa aldatzea huts egin du.
ka: ჩანაწერის შეცვლის შეცდომა.
ru: Не удалось изменить запись.
sl: Sprememba zapisa ni uspelo.
zh_tw: 紀錄變更失敗。

# KDbTableViewData|
source: Record deleting failed.
ar: فشل حذف السجل.
az: Yazı silinə bilmədi.
el: Αποτυχία διαγραφής εγγραφής.
eo: Rikorda forigo malsukcesis.
et: Kirje kustutamine nurjus.
eu: Erregistroa ezabatzea huts egin du.
ka: ჩანაწერის დამატების შეცდომა.
ru: Не удалось удалить запись.
sl: Brisanje zapisa ni uspelo.
zh_tw: 紀錄刪除失敗。

# KDbTableViewData|
source: Please correct data in this record or use the "Cancel record changes" function.
ar: صحِّح البيانات في هذا السجل أو استخدِم وظيفة «إلغاء تغييرات السجل».
az: Bu yazıdakı məlumatları düzəldin və ya "Yazı dəyişikliklərini ləğv etmək" funksiyasını istifadə edin.
el: Διορθώστε τα δεδομένα σε αυτήν την εγγραφή ή χρησιμοποιήστε τη συνάρτηση «Ακύρωση αλλαγών σε εγγραφή».
eo: Bonvolu korekti datumojn en ĉi tiu rikordo aŭ uzi la funkcion "Nuligi rikordajn ŝanĝojn".
et: Palun korrigeeri selle kirje andmeid või kasuta võimalust "Loobu kirje muudatustest".
eu: Zuzendu erregistro honetako datuak edo erabili «Utzi erregistroko aldaketak» funtzioa.
ka: გთხოვთ, ჩაასწორეთ მონაცემები ამ ჩანაწერში ან გამოიყენეთ ფუნქცია "ჩანაწერის ცვლილებების გაუქმება".
ru: Исправьте данные в этой записи или воспользуйтесь функцией «Отменить изменение записи».
sl: Popravite podatke v tem zapisu ali uporabite funkcijo "Prekliči spremembe zapisa".
zh_tw: 請改正這個紀錄中的資料，或是使用「取消紀錄變更」功能。
