Repository: KDE/kdb
Catalog: poqm/*/kdb_sqlitedriver_qt.po
Languages: ar, az, el, eo, et, eu, he, ia, ka, sl

# SqliteVacuum|
source: Could not compact database "%1".
ar: لم أقدر على ضغط قاعدة البيانات «%1».
az: "%1" verilənlər bazası yığıla bilmədi.
el: Αδυναμία σύμπτυξης βάσης δεδομένων «%1».
eo: Ne eblis kompakti datumbazon "%1".
et: Andmebaasi "%1" tihendamine nurjus.
eu: Ezin izan da "%1" datu-basea trinkotu.
he: לא ניתן לדחוס את מסד הנתונים „%1”.
ia: Non pote compactar base de datos "%1".
ka: ბაზის ("%1") დაპატარავების შეცდომა.
sl: Ni bilo mogoče strniti baze podatkov "%1".

# SqliteConnection|
source: Extra paths for SQLite plugins
ar: مسارات إضافية لمكونات SQLite الإضافية
az: SQLite qoşmaları üçün əlavə yollar
el: Επιπλέον διαδρομές για πρόσθετα SQLite
eo: Kromaj vojoj por SQLite-kromaĵoj
et: SQLite'i pluginate lisaasukohad
eu: SQLite pluginentzako bide-izen gehigarriak
he: נתיבים נוספים לתוספי SQLite
ia: Percursos extra per plugins de SQLite
ka: დამატებითი ბილიკები SQLite-ის დამატებებისთვის
sl: Posebne poti za vtičnike za SQLite

# SqliteConnection|
source: Could not delete file "%1". Check the file's permissions and whether it is already opened and locked by another application.
ar: لم أقدر على حذف الملف «%1». تفحّص صلاحيات الملف و انظر إن فتحه تطبيق آخر وقفله.
az: "%1" faylı silinə bilmədi. Fayl icazələrini və onun başqa tətbiq tərəfindən açılıb-açılmadığını və ya kilidlənib-kilidlənmədiyinj yoxlayın.
el: Αδυναμία διαγραφής του αρχείου «%1». Ελέγξτε τα δικαιώματα του αρχείου και αν αυτό είναι ήδη ανοιχτό και κλειδωμένο από άλλη εφαρμογή.
eo: Ne eblis forigi dosieron "%1". Kontrolu la permesojn de la dosiero kaj ĉu ĝi jam estas malfermita kaj ŝlosita de alia aplikaĵo.
et: Faili "%1" kustutamine nurjus. Kontrolli faili õigusi ja seda, ega see ei ole juba avatud ja lukustatud mõnes muus rakenduses.
eu: Ezin da ezabatu "%1" fitxategia. Egiaztatu fitxategiaren baimenak eta beste aplikazio batek dagoeneko ireki eta blokeatu duen.
he: לא ניתן למחוק את הקובץ „%1”. נא לבדוק את הרשאות הקובץ והאם הוא כבר פתוח ונעול על ידי יישום אחר.
ia: Non poteva deler file "%1". Verifica le permissiones def file e illo es ja aperite e blocate per un altere application.
ka: "%1"-ის წაშლის შეცდომა. გადაამოწმეთ ფაილის წვდომები და ხომ არ არის უკვე ღია და დაბლოკილი სხვა აპლიკაციების მიერ.
sl: Datoteke "%1" ni bilo mogoče izbrisati. Preverite dovoljenja datoteke in ali jo je že odprla in zaklenila neka druga aplikacija.

# SqliteConnection|
source: Could not load SQLite plugin "%1".
ar: لم أقدر على تحميل مكون SQLite الإضافي «%1».
az: "%1" SQLite qoşması yüklənmədi.
el: Αδυναμία φόρτωσης του πρόσθετου «%1» της SQLite.
eo: Ne eblis ŝargi SQLite-aldonaĵon "%1".
et: SQLite'i plugina "%1" laadimine nurjus.
eu: Ezin izan da zamatu "%1" SQLite plugina.
he: לא ניתן לטעון את תוסף ה־SQLite ‏„%1”.
ia: Non poteva cargar plugin "%1" de SQLite.
ka: SQLite-ის დამატების "%1" ჩატვირთვის შეცდომა.
sl: Ni mogoče naložiti vtičnika SQLite "%1".

# SqliteConnection|
source: Could not find SQLite plugin file "%1".
ar: لم أقدر على العثور على ملف مكون SQLite الإضافي «%1».
az: "%1" AQLite qoşması faylı tapılmadı.
el: Αδυναμία εύρεσης του αρχείου προσθέτου «%1» της SQLite.
eo: Ne eblis trovi la kromprogramon de SQLite "%1".
et: SQLite'i plugina faili "%1" ei leitud.
eu: Ezin izan da aurkitu "%1" SQLite plugin fitxategia.
he: לא מסוגל למצוא את קובץ תוסף ה־SQLite ‏„%1”.
ia: Non poteva trovarfile "%1" de plugin de SQLite .
ka: SQLite-ის დამატების ფაილის "%1" ჩატვირთვის შეცდომა.
sl: Ni mogoče najti datoteke vtičnika SQLite "%1".

# SqliteConnection|
source: Could not load SQLite extension "%1".
ar: لم أقدر على تحميل امتداد SQLite «%1».
az: "%1" SQLite genişlənməsi yüklənə bilmədi.
el: Αδυναμία φόρτωσης της επέκτασης «%1» της SQLite.
eo: Ne eblis ŝargi la etendon de SQLite "%1".
et: SQLite'i laienduse "%1" laadimine nurjus.
eu: Ezin izan da zamatu "%1" SQLite hedapena.
he: לא ניתן לטעון את הרחבת ה־SQLite ‏„%1”.
ia: Non poteva cargar extension "%1" de SQLite.
ka: SQLite-ის გაფართოების "%1" ჩატვირთვის შეცდომა.
sl: Ni bilo mogoče naložiti razširitve SQLite "%1".

# SqliteVacuum|
source: Could not find tool "%1".
ar: لا يمكن العثور على أداة "%1".
az: "%1" aləti tapılmadı.
el: Αδυναμία εύρεσης τιυ εργαλείου «%1».
eo: Ne eblis trovi ilon "%1".
et: Tööriista "%1" ei leitud.
eu: Ezin izan da aurkitu "%1" tresna.
he: לא ניתן למצוא את הכלי „%1”.
ia: Il non pote trovar instrumento "%1".
ka: პროგრამა "%1" ვერ ვიპოვე.
sl: Ni bilo mogoče najti orodja "%1".

# SqliteVacuum|
source: Could not find application "%1".
ar: لم أقدر على العثور على تطبيق «%1».
az: "%1" tətbiqi tapılmadı.
el: Αδυναμία εύρεσης της εφαρμογής «%1».
eo: Ne eblis trovi aplikaĵon "%1".
et: Rakendust "%1" ei leitud.
eu: Ezin izan da aurkitu "%1" aplikazioa.
he: לא ניתן למצוא את היישום „%1”.
ia: Il non pote trovar application '%1".
ka: აპლიკაცია "%1" ვერ ვიპოვე.
sl: Ni bilo mogoče najti aplikacije "%1".

# SqliteVacuum|
source: Could not read file "%1".
ar: لم أقدر على قراءة الملف «%1».
az: "%1" Faylı oxunmadı.
el: Αδυναμία ανάγνωσης του αρχείου «%1».
eo: Ne eblis legi dosieron "%1".
et: Faili "%1" lugemine nurjus.
eu: Ezin izan du irakurri "%1" fitxategia.
he: לא ניתן לקרוא את הקובץ „%1”.
ia: Il non pote leger le file '%1'
ka: ფაილის ("%1") წაკითხვის შეცდომა.
sl: Ni bilo mogoče brati datoteke "%1".

# SqliteVacuum|
source: Compacting database
ar: اضغط قاعدة البيانات
az: Verilənlər bazasının sıxılması
el: Σύμπτυξη βάσης δεδομένων
eo: Kompakta datumbazo
et: Andmebaasi tihendamine
eu: Datu-basea trinkotzen
he: מסד הנתונים נדחס
ia: Compactante base de datos
ka: ბაზის დაკომპაქტება
sl: Strnjevanje podatkovne baze

# SqliteVacuum|
source: Compacting database "%1"...
ar: اضغط قاعدة البيانات «%1»...
az: "%1" verilənlər bazası sıxılır...
el: Σύμπτυξη βάσης δεδομένων «%1»...
eo: Kompaktante datumbazon "%1"...
et: Andmebaasi "%1" tihendamine ...
eu: "%1" datu-basea trinkotzen...
he: מסד הנתונים „%1” נדחס…
ia: Compactante base de datos "%1"...
ka: მიმდინარეობს ბაზის ("%1") დაპატარავება...
sl: Strnjevanje podatkovne baze "%1"...

# SqliteVacuum|
source: Could not rename file "%1" to "%2".
ar: لم أقدر على إعادة تسمية الملف «%1» إلى «%2».
az: "%1" faylı "%2" olaraq dəyişdirilə bilmədi.
el: Αδυναμία μετονομασίας του αρχείου «%1» σε «%2».
eo: Ne eblis renomi dosieron "%1" al "%2".
et: Failile "%1" nime "%2" andmine nurjus.
eu: Ezin izan da "%1" fitxategia "%2" gisa berrizendatu.
he: לא ניתן לשנות את השם של הקובץ „%1” לשם „%2”.
ia: Il non pote renominar file "%1" a "%2".
ka: ფაილის "%1"-დან "%2"-ად გადარქმევის შეცდომა.
sl: Ni bilo mogoče preimenovati datoteke "%1" v "%2".

# SqliteVacuum|
source: The database has been compacted. Current size decreased by %1% to %2 MB.
ar: ضغط قاعدة البيانات، انقص حجمها الحالي بنسبة %1% حتى %2 ميغابايت.
az: Verilənlər bazası sıxıldı. Cari ölçü %1% azalaraq %2 MB oldu.
el: Η βάση δεδομένων έχει συμπτυχθεί. Το τρέχον μέγεθος έχει ελαττωθεί κατά %1% σε %2 MB.
eo: La datumbazo estis kompaktita. Nuna grandeco malpliiĝis je %1% al %2 MB.
et: Andmebaas on tihendatud. Suurus vähenes %1% võrra %2 MB peale.
eu: Datu-basea trinkotu da. Uneko neurria %%1 txikitu da, %2 MBera.
he: מסד הנתונים נדחס. הגודל פחת ב־%1% ל־%2 מ״ב.
ia: Le base de datos ha essite compactate. Grandor currente diminuite ab %1% a %2 MB.
ka: ბაზა დაპატარავებულია. მიმდინარე ზომა %1%-დან %2მბ-მდე შემცირდა.
sl: Baza podatkov je bila strnjena. Trenutna velikost se je zmanjšala za %1% na %2 MB.
