Repository: KDE/kdb
Catalog: poqm/*/kdb_qt.po
Languages: ar, az, el, eo, et, eu, ka, ru, sl, zh_tw

# KDbVariableExpressionData|
source: Could not access the table directly using its name
ar: لا أستطيع الوصول إلى الجدول مباشرة باستخدام اسمه
az: Adını istifadə edərək cədvələ birbaşa daxil olmaq mümkün olmadı
el: Αδυναμία πρόσβασης σε πίνακα με απευθείας χρήση του ονόματός του
eo: Ne eblis aliri la tabelon rekte uzante ĝian nomon
et: Otsene juurdepääs tabelile selle nime kaudu nurjus.
eu: Ezin izan da taula zuzenean atzitu bere izena erabiliz
ka: ცხრილთან სახელით პირდაპირი წვდომა შეუძლებელია
ru: Не удалось получить доступ к таблице напрямую, используя её имя
sl: Ni bilo mogoče neposredno dostopati do tabele z uporabo njenega imena
zh_tw: 無法直接使用表格名稱來存取它

# KDbVariableExpressionData|
source: Table name "%1" is covered by aliases. Instead of "%2", "%3" can be used.
ar: اسم الجدول «%1» مغطى بالأسماء المستعارة. بدلًا من «%2»، استخدِم «%3».
az: "%1" cədvəl adı qoyma adla verilib. "%2" əvəzinə "%3" istifadə etmək olar.
el: Το όνομα «%1» του πίνακα καλύπτεται από ψευδώνυμα. Αντί του «%2», το «%3» μπορεί να χρησιμοποιηθεί.
eo: Tabelnomo "%1" estas kovrita de kaŝnomoj. Anstataŭ "%2", "%3" povas esti uzata.
et: Tabeli nime "%1" varjavad aliased. Selle asemel võiks kasutada "%2", "%3".
eu: "%1" taula izenak ezizenak ditu. "%2" erabili ordez, "%3" erabili daiteke.
ka: ცხრილის სახელი "%1" მეტსახელებითაა დაკავებული. სამაგიეროდ შეგიძლიათ გამოიყენოთ "%2","%3".
ru: Для таблицы с именем «%1» возможно использовать псевдонимы. Вместо «%2» можно использовать «%3».
sl: Ime tabele "%1" je prekrito s sinonimi. Namesto "%2" lahko uporabite "%3".
zh_tw: 表格名稱「%1」有別名。可以使用「%3」而非「%2」。

# KDbVariableExpressionData|
source: Table not found
ar: الجدول غير موجود
az: Cədvəl tapılmadı
el: Ο πίνακας δε βρέθηκε
eo: Tabelo ne trovita
et: Tabelit ei leitud
eu: Taula ez da aurkitu
ka: ცხრილი ვერ ვიპოვე
ru: Таблица не найдена
sl: Tabele ni mogoče najti
zh_tw: 找不到表格

# KDbVariableExpressionData|
source: Unknown table "%1".
ar: الجدول «%1» غير معروف.
az: Naməlum cədvəl "%1"
el: Άγνωστος πίνακας «%1».
eo: Nekonata tabelo "%1".
et: Tundmatu tabel "%1".
eu: Taula ezezaguna "%1".
ka: უცნობი ცხრილი "%1".
ru: Неизвестная таблица «%1».
sl: Neznana tabela "%1".
zh_tw: 未知的表格「%1」。

# KDbVariableExpressionData|
source: Ambiguous "%1.*" expression
ar: التعبير «%1.*» غامض
az: Qeyri-müəyyən "%1.*" ifadəsi
el: Ασαφής «%1.*» έκφραση
eo: Ambigua esprimo "%1.*"
et: Umbmäärane "%1.*" avaldis
eu: "%1.*" adierazpen anbiguoa
ka: არასწორი "%1".*" გამოსახულება
ru: Неоднозначное выражение «%1.*»
sl: Dvoumen izraz "%1.*"
zh_tw: 模糊的 "%1.*" 表達式

# KDbVariableExpressionData|
source: More than one "%1" table or alias defined.
ar: عرِّف أكثر من جدول أو اسم مستعار واحد «%1».
az: "%1" üçün birdən cədvəl və qoyma ad müəyyənləşdirilib.
el: Περισσότεροι του ενός «%1» πίνακες ή ψευδώνυμα έχουν ορισθεί.
eo: Pli ol unu tabelo "%1" aŭ kaŝnomo estas difinita.
et: Defineeritud on üle ühe "%1" tabeli või aliase.
eu: "%1" taula edo ezizen bat baino gehiago definitu da.
ka: აღმოჩენილია ერთზე მეტი "%1" ცხრილი ან მეტსახელი.
ru: Задано больше одной таблицы или псевдонима «%1».
sl: Več kot ena tabela "%1" ali določen sinonim.

# KDbVariableExpressionData|
source: Table "%1" has no "%2" field.
ar: الجدول «%1» ليس لديه الحقل «%2».
az: "%1" cədvəlində "%2" sahəsi yoxdur.
el: Ο πίνακας «%1» δεν έχει «%2» πεδίο.
eo: Tabelo "%1" ne havas kampon "%2".
et: Tabelis "%1" ei ole välja "%2".
eu: "%1" taulak ez du "%2" eremurik.
ka: ცხრილს "%1" ველი "%2" არ გააჩნია.
ru: В таблице «%1» нет поля «%2».
sl: Tabela "%1" nima polja "%2".

# KDbVariableExpressionData|
source: Ambiguous "%1.%2" expression
ar: التعبير «%1.%2» غامض
az: Qeyri-müəyyən "%1.%2" ifadəsi
el: Ασαφής «%1.%2» έκφραση
eo: Ambigua esprimo "%1.%2"
et: Umbmäärane "%1.%2" avaldis
eu: "%1.%2" adierazpen anbiguoa
ka: საეჭვო "%1.%2" გამოსახულება
ru: Неоднозначное выражение «%1.%2»
sl: Dvoumen izraz "%1.%2"
zh_tw: 模糊的 "%1.%2" 表達式

# KDbVariableExpressionData|
source: More than one "%1" table or alias defined containing "%2" field.
ar: عرِّف أكثر من جدول أو اسم مستعار واحد «%1» يحتوي على الحقل «%2».
az: "%2" sahəsi, birdən çox "%1" cədvəli və ləqəbindən ibarətdir.
el: Περισσότεροι του ενός «%1» πίνακες ή ψευδώνυμα που ορίσθηκαν περιέχουν το πεδίο «%2».
eo: Pli ol unu tabelo "%1" aŭ kaŝnomo estas difinita enhavanta kampon "%2".
et: Defineeritud on üle ühe "%1" tabeli või aliase, mis sisaldavad "%2" välja.
eu: "%2" eremua duen "%1" taula edo ezizen bat baino gehiago dago.
ka: ერთზე მეტი "%1" ცხრილი ან აღწერილი მეტსახელი შეიცავს ველს "%2".
ru: Задано больше одной таблицы или псевдонима «%1», содержащих поле «%2».
sl: Več kot ena tabela "%1" ali sinonim, ki vsebuje polje "%2".

# ConnectionTestDialog|Dialog's title: testing database connection
source: Test Connection
ar: اختبر الاتصال
az: Sınamaq üçün bağlantı
el: Δοκιμή σύνδεσης
eo: Testa Konekto
et: Ühenduse testimine
eu: Probako konexioa
ka: შეერთების შემოწმება
ru: Тестовое соединение
sl: Preizkus povezave
zh_tw: 測試連線

# ConnectionTestDialog|
source: Testing connection to "%1" database server...
ar: اختبار الاتصال بخادوم قاعدة البيانات «%1»...
az: "%1" verilənlər bazası serverinə bağlantı yoxlanılır...
el: Δοκιμή σύνδεσης στον «%1» εξυπηρετητή βάσεων δεδομένων...
eo: Testante konekton al datumbaza servilo "%1"...
et: Ühenduse testimine "%1" andmebaasiserveriga ...
eu: "%1" datu-base zerbitzarira konexioa probatzen...
ka: "%1" ბაზის სერვერთან მიერთების მოსინჯვა...
ru: Тестовое соединение с сервером базы данных «%1»…
sl: Testiranje povezave s strežnikom baze podatkov "%1"...
zh_tw: 正在測試到資料庫伺服器「%1」的連線...

# ConnectionTestDialog|
source: Test connection to "%1" database server failed.
ar: فشل اختبار الاتصال بخادوم قاعدة البيانات «%1».
az: "%1" verilənlər bazası serverinə bağlantının yoxlanılması alınmadı.
el: Αποτυχία δοκιμής σύνδεσης στον «%1» εξυπηρετητή βάσεων δεδομένων
eo: Prova konekto al datumbaza servilo "%1" malsukcesis.
et: Ühenduse testimine "%1" andmebaasiserveriga nurjus.
eu: "%1" datu-base zerbitzarira probako konexioak huts egin du.
ka: "%1" ბაზის სერვერთან მიერთების მოსინჯვის შეცდომა.
ru: Не удалось установить тестовое соединение с сервером базы данных «%1».
sl: Preskus povezave s strežnikom baz podatkov "%1" ni uspel.
zh_tw: 到資料庫伺服器「%1」的測試連線已失敗。

# ConnectionTestDialog|
source: Test connection to "%1" database server failed. The server is not responding.
ar: فشل اختبار الاتصال بخادوم قاعدة البيانات «%1». الخادوم لا يستجيب.
az: "%1" verilənlər bazası serverinə bağlantının yoxlanılması alınmadı. Server cavab vermir.
el: Αποτυχία δοκιμής σύνδεσης στον «%1» εξυπηρετητή βάσεων δεδομένων. Ο εξυπηρετητής δεν ανταποκρίνεται.
eo: Prova konekto al datumbaza servilo "%1" malsukcesis. La servilo ne respondas.
et: Ühenduse testimine "%1" andmebaasiserveriga nurjus. Server ei vasta.
eu: "%1" datu-base zerbitzarira probako konexioak huts egin du. Zerbitzariak ez du erantzuten.
ka: "%1" ბაზის სერვერთან მიერთების მოსინჯვის შეცდომა. სერვერი არ პასუხობს.
ru: Не удалось установить тестовое соединение с сервером базы данных «%1». Сервер не отвечает.
sl: Preskus povezave s strežnikom baz podatkov "%1" ni uspel. Strežnik se ne odziva.
zh_tw: 到資料庫伺服器「%1」的測試連線已失敗。伺服器沒有回應。

# ConnectionTestDialog|
source: Test connection to "%1" database server established successfully.
ar: أنشئ اتصال اختبار بخادوم قاعدة البيانات «%1» بنجاح.
az: "%1" verilənlər bazası serverinə sınaq bağlantısı uğurla quruldu.
el: Η δοκιμή σύνδεσης στον «%1» εξυπηρετητή βάσεων δεδομένων ήταν επιτυχής.
eo: Prova konekto al datumbaza servilo "%1" sukcese establita.
et: Ühenduse testimine "%1" andmebaasiserveriga läks edukalt.
eu: "%1" datu-base zerbitzarira probako konexioa ondo ezarri da.
ka: "%1" ბაზის სერვერთან მიერთების მოსინჯვა წარმატებულად დასრულდა.
ru: Тестовое соединение с сервером базы данных «%1» успешно установлено.
sl: Preskusna povezava s strežnikom baze podatkov "%1" je bila uspešno vzpostavljena.
zh_tw: 到資料庫伺服器「%1」的測試連線已成功建立。

# ConnectionTestDialog|
source: Test Connection
ar: اختبر الاتصال
az: Sınamaq üçün bağlantı
el: Δοκιμή σύνδεσης
eo: Testa Konekto
et: Ühenduse testimine
eu: Probako konexioa
ka: შეერთების შემოწმება
ru: Тестовое соединение
sl: Preizkusna povezava
zh_tw: 測試連線

# KDb|
source: Message from server:
ar: رسالة من الخادوم:
az: Serverin ismarıcı:
el: Μήνυμα από εξυπηρετητή:
eo: Mesaĝo de servilo:
et: Teade serverist:
eu: Zerbitzariko mezua:
ka: შეტყობინება სერვერიდან:
ru: Сообщение от сервера:
sl: Sporočilo strežnika:
zh_tw: 來自伺服器的訊息：

# KDb|
source: SQL statement:
ar: عبارة SQL:
az: SQL təlimatı
el: SQL πρόταση:
eo: SQL-deklaro:
et: SQL-lause:
eu: SQL adierazpena:
ka: SQL ოპერატორი:
ru: SQL-выражение:
sl: Stavek SQL:
zh_tw: SQL 敘述：

# KDb|
source: Server result code:
ar: رمز نتيجة الخادوم:
az: Serverin cavab kodu:
el: Κωδικός αποτελέσματος του εξυπηρετητή:
eo: Servila rezultokodo:
et: Serveri vastuse kood:
eu: Zerbitzariko emaitza kodea:
ka: სერვერის შედეგის კოდი:
ru: Код ответа сервера:
sl: Koda rezultata SQL:
zh_tw: 伺服器結果碼：

# KDb|
source: Server result:
ar: نتيجة الخادوم:
az: Serverin cavabı:
el: Αποτέλεσμα από εξυπηρετητή:
eo: Servila rezulto:
et: Serveri vastus:
eu: Zerbitzariko emaitza:
ka: სერვერის შედეგი:
ru: Ответ сервера:
sl: Rezultat strežnika:
zh_tw: 伺服器結果：

# KDbField|
source: Number
ar: رقم
az: Say
el: Αριθμός
eo: Nombro
et: Arv
eu: Zenbakia
ka: რიცხვი
ru: Число
sl: Število
zh_tw: 數字

# KDbField|
source: Image
ar: صورة
az: Şəkil
el: Εικόνα
eo: Bildo
et: Pilt
eu: Irudia
ka: გამოსახულება
ru: Изображение
sl: Slika
zh_tw: 影像

# KDb|
source: Value of "%1" field must be an identifier.
ar: يجب أن تكون قيمة الحقل «%1» معرِّفًا.
az: "%1" sahəsinin dəyəri identifikator olmalıdır.
el: Η τιμή του πεδίου «%1» πρέπει να είναι αναγνωριστικό.
eo: Valoro de kampo "%1" devas esti identigilo.
et: Välja "%1" väärtus peab olema identifikaator.
eu: "%1" eremuko balioa identifikatzaile bat izan behar da.
ka: ველის "%1" მნიშვნელობა იდენტიფიკატორი უნდა იყოს.
ru: Значением поля «%1» должен быть идентификатор.
sl: Vrednost polja "%1" mora biti identifikator.
zh_tw: 「%1」欄位的值必須是識別子。

# KDb|
source: "%1" is not a valid identifier.
ar: «%1» ليس معرِّفًا صالحًا.
az: "%1" etibarlı identifikator deyil.
el: Το «%1» δεν είναι έγκυρο αναγνωριστικό.
eo: "%1" ne estas valida identigilo.
et: "%1" ei ole korrektne identifikaator.
eu: "%1" ez da identifikatzaile balioduna.
ka: "%1" არასწორი იდენტიფიკატორია.
ru: «%1» не является корректным идентификатором.
sl: "%1" ni veljaven identifikator.
zh_tw: 「%1」不是有效的識別子。

# KDbConnectionOptions|Read only connection
source: Read only
ar: للقراءة فقط
az: Yalnız oxumaq
el: Ανάγνωση μόνο
eo: Nurlege
et: Kirjutuskaitstud
eu: Irakurtzeko soilik
ka: მხოლოდ წაკითხვა
ru: Только для чтения
sl: Samo za branje
zh_tw: 唯讀

# KDbConnection|
source: Invalid database contents. %1
ar: محتويات قاعدة بيانات غير صالحة. %1
az: Yalnıış verilənlər bazası tərkibi. %1
el: Μη έγκυρα περιεχόμενα βάσης δεδομένων. %1
eo: Nevalida datumbaza enhavo. %1
et: Vigane andmebaasi sisu. %1
eu: Datu-base eduki baliogabea. %1
ka: ბაზის არასწორი შემცველობა. %1
ru: Недопустимое содержимое базы данных. %1
sl: Neveljavna vsebina podatkovne baze. %1
zh_tw: 無效的資料庫內容。%1

# KDbConnection|
source: It is a system object.
ar: إنه كائن نظام.
az: Bu sistem obyektidir.
el: Είναι αντικείμενο συστήματος.
eo: Ĝi estas sistema objekto.
et: See on süsteemne objekt.
eu: Sistema objektu bat da.
ka: სისტემის ობიექტია.
ru: Это системный объект.
sl: To je sistemski objekt.
zh_tw: 它是一個系統物件。

# KDbConnectionPrivate|
source: Table has no fields defined.
ar: الجدول ليس لديه حقول معرَّفة.
az: Cədvəldə müəyyən edilmiş sahələr yoxdur.
el: Ο πίνακας δεν περιέχει πεδία.
eo: Tabelo ne havas kampojn difinitajn.
et: Tabelis ei ole välju defineeritud.
eu: Taulak ez dauka definituta eremurik.
ka: ცხრილს ველები აღწერილი არ აქვს.
ru: Не заданы поля в таблице.
sl: Tabela nima določenih polj.
zh_tw: 表格沒有定義任何欄位。

# KDbConnectionPrivate|
source: Could not find definition for query "%1". Deleting this query is recommended.
ar: لا أجد تعريفًا للاستعلام «%1». يوصى بحذف هذا الاستعلام.
az: "%1" tələbinin açıqlaması tapılmadı. Bu sorğunun silonməsi məsləhətdir.
el: Αδυναμία εύρεσης ορισμού για το ερώτημα «%1». Συνιστάτι η διαγραφή αυτού του ερωτήματος.
eo: Ne eblis trovi difinon por demando "%1". Forigi ĉi tiun demandon rekomendas.
et: Päringule "%1" ei leitud definitsiooni. Soovitatav on see päring kustutada.
eu: Ezin da aurkitu "%1" itaunaren definizioa. Itaun hau ezabatzea gomendatzen da.
ka: მოთხოვნისთვის "%1" აღწერა ვერ ვიპოვე. გირჩევთ, წაშალოთ ეს მოთხოვნა.
ru: Не удалось найти определение для запроса «%1». Рекомендуется удалить этот запрос.
sl: Ni mogoče najti definicije za poizvedbo "%1". Priporočljivo je brisanje te poizvedbe.
zh_tw: 找不到查詢「%1」的定義。建議刪除此查詢。

# KDbConnectionPrivate|
source: <p>Could not load definition for query "%1". SQL statement for this query is invalid:<br><tt>%2</tt></p> <p>This query can be edited only in Text View.</p>
ar: <p>لا أستطيع تحميل تعريف الاستعلام «%1». عبارة SQL لهذا الاستعلام غير صالحة:<br><tt>%2</tt></p> <p>حرِّر هذا الاستعلام في عرض النص فقط.</p>
az: <p>"%1" sorğusunun açıqlaması tapılmadı. Bu sorğu üçün SQL təlimatı düzgün deyil: <br><tt>%2</tt></p> <p>Bu sorğuya yalnız Mətn şəkilində düzəliş edilə bilər.</p>
el: <p>Αδυναμία φόρτωσης ορισμού για το ερώτημα «%1». Η SQL πρόταση για το ερώτημα αυτό δεν είναι έγκυρη:<br><tt>%2</tt></p> <p>Η επεξεργασία αυτού του ερωτήματος μπορεί να γίνει μόνο στην προβολή κειμένου.</p>
eo: <p>Ne eblis ŝargi difinon por demando "%1". SQL-deklaro por ĉi tiu demando estas nevalida:<br><tt>%2</tt></p> <p>Ĉi tiu demando estas redaktebla nur en Teksta Vido.</p>
et: <p>Päringu "%1" definitsiooni laadimine nurjus. Selle päringu SQL-lause on vigane:<br><tt>%2</tt></p> <p>Seda päringut saab muuta ainult tekstivaates.</p>
eu: <p>Ezin da aurkitu "%1" itaunaren definizioa. Itaun honen adierazpena baliogabea da: <br><tt>%2</tt></p> <p>Itaun hau editatu daiteke soilik Testu Ikuspegian.</p>
ka: <p>მოთხოვნის "%1" აღწერის ჩატვირთვის შეცდომა. მოთხოვნის SQL ოპერატორი არასწორია:<br><tt>%2</tt></p> <p>ამ მოთხოვნის ჩასწორება მხოლოდ ტექსტურ ხედში შეგიძლიათ.</p>
ru: <p>Не удалось загрузить определение для запроса «%1». Недопустимое SQL-выражение для этого запроса:<br><tt>%2</tt></p> <p>Этот запрос возможно редактировать только в текстовом представлении.</p>
sl: <p>Definicije za poizvedbo "%1" ni bilo mogoče naložiti. Stavek SQL za to poizvedbo ni veljaven:<br><tt>%2</tt></p> <p>To poizvedbo lahko urejate samo v pogledu besedila.</p>
zh_tw: <p>無法載入查詢「%1」的定義。此查詢的 SQL 敘述無效：<br><tt>%2</tt></p> <p>這個查詢只能在文字檢視中編輯。</p>

# KDbConnection|
source: Connection already established.
ar: الأتصال قائم بالفعل.
az: Bağlantı artıq qurulub.
el: Η σύνδεση έχει ήδη γίνει.
eo: Konekto jam establita.
et: Ühendus on juba loodud.
eu: Konexioa jada ezarrita dago.
ka: კავშირი უკვე დამყარებულია.
ru: Соединение уже установлено.
sl: Povezava je že vzpostavljena.
zh_tw: 連線已建立。

# KDbConnection|
source: Could not open "%1" project file.
ar: لا أستطيع فتح ملف المشروع «%1».
az: "%1" layihəsi faylı tapılmadı.
el: Αδυναμία ανοίγματος του «%1» αρχείου έργου.
eo: Ne eblis malfermi projektdosieron "%1".
et: "%1" projektifaili avamine nurjus.
eu: Ezin izan da "%1" proiektu fitxategia ireki.
ka: პროექტის ფაილის "%1" გახსნის შეცდომა.
ru: Не удалось открыть файл проекта «%1».
sl: Ni bilo mogoče odpreti projektne datoteke "%1".
zh_tw: 無法開啟「%1」專案檔。

# KDbConnection|
source: Could not connect to "%1" database server.
ar: لا أستطيع الاتصال بخادوم قاعدة البيانات «%1».
az: "%1" verilənlər bazası serveri ilə bağlantı yaradıla bilmədi.
el: Αδυναμία σύνδεσης στον εξυπηρετητή βάσεων δεδομένων «%1».
eo: Ne eblis konekti al datumbaza servilo "%1".
et: Ühendumine "%1" andmebaasiserveriga nurjus.
eu: Ezin izan da konektatu "%1" datu-base zerbitzarira.
ka: ბაზის სერვერთან ("%1") მიერთების შეცდომა.
ru: Не удалось подключиться к серверу баз данных «%1».
sl: Ni se bilo mogoče povezati do strežnika podatkovne baze "%1".
zh_tw: 無法連線到「%1」資料庫伺服器。

# KDbConnection|
source: Not connected to the database server.
ar: ليس متصلًا بخادوم قاعدة البيانات.
az: Verilənlər bazası serveri ilə bağlantı yoxdur.
el: Χωρίς σύνδεση στον εξυπηρετητή βάσεων δεδομένων.
eo: Ne konektita al la datumbaza servilo.
et: Ühendus andmebaasiserveriga puudub.
eu: Ez dago datu-base zerbitzarira konektatuta.
ka: ბაზის სერვერთან მიერთებული არ ბრძანდებით.
ru: Нет подключения к серверу баз данных.
sl: Ni povezave s strežnikom baze podatkov.
zh_tw: 未連線到資料庫伺服器。

# KDbConnection|
source: Currently no database is used.
ar: لا أستخدم قاعدة بيانات حاليًّا.
az: Hal-hazırda verilənlər bazası istifadə olunmur.
el: Προς το παρόν καμία βάση δεδομένων δεν χρησιμοποιείται.
eo: Nuntempe neniu datumbazo estas uzata.
et: Praegu ei kasutata ühtegi andmebaasi.
eu: Une honetan ez da datu-baserik erabiltzen.
ka: ამჟამად ბაზა არ გამოიყენება.
ru: В данный момент нет используемых баз данных.
sl: Trenutno ni v rabi nobene podatkovne baze.
zh_tw: 目前沒有使用任何資料庫。

# KDbConnection|
source: The database "%1" does not exist.
ar: قاعدة البيانات «%1» غير موجودة.
az: "%1" verilənlər bazasımövcud deyil.
el: Η βάση δεδομένων «%1» δεν υπάρχει.
eo: La datumbazo "%1" ne ekzistas.
et: Andmebaasi "%1" ei ole olemas.
eu: "%1" datu-basea ez da existitzen.
ka: ბაზა "%1" არ არსებობს.
ru: База данных «%1» не существует.
sl: Podatkovna baze "%1" ne obstaja.
zh_tw: 資料庫「%1」不存在。

# KDbConnection|
source: The database file "%1" does not exist.
ar: ملف قاعدة البيانات «%1» غير موجود.
az: "%1" verilənlər bazası faylı mövcud deyil.
el: Το αρχείο «%1» βάσης δεδομένων δεν υπάρχει.
eo: La datumbaza dosiero "%1" ne ekzistas.
et: Andmebaasifaili "%1" ei ole olemas.
eu: "%1" datu-base fitxategia ez da existitzen.
ka: ბაზა "%1" არ არსებობს.
ru: Файл базы данных «%1» не существует.
sl: Datoteka podatkovne baze "%1" ne obstaja.
zh_tw: 資料庫檔案「%1」不存在。

# KDbConnection|
source: Database file "%1" is not readable.
ar: ملف قاعدة البيانات «%1» غير قابل للقراءة.
az: "%1" verilənlər bazası faylı oxuna bilən deyil.
el: Το αρχείο «%1» βάσης δεδομένων δεν είναι αναγνώσιμο.
eo: La datumbaza dosiero "%1" ne estas legebla.
et: Andmebaasifail "%1" ei ole loetav.
eu: "%1" datu-base fitxategia ezin da irakurri.
ka: ბაზის ფაილი "%1" წაკითხვადი არაა.
ru: Файл базы данных «%1» недоступен для чтения.
sl: Datoteka podatkovne baze "%1" ni berljiva.
zh_tw: 資料庫檔案「%1」無法讀取。

# KDbConnection|
source: Database file "%1" is not writable.
ar: ملف قاعدة البيانات «%1» غير قابل للكتابة.
az: "%1" verilənlər bazası faylı yazıla bilən deyil.
el: Το αρχείο «%1» βάσης δεδομένων δεν είναι εγγράψιμο.
eo: La datumbaza dosiero "%1" ne estas skribebla.
et: Andmebaasifail "%1" ei ole kirjutatav.
eu: "%1" datu-base fitxategia ezin da idatzi.
ka: ბაზის ფაილი "%1" ჩაწერადი არაა.
ru: Файл базы данных «%1» недоступен для записи.
sl: Datoteka podatkovne baze "%1" ni zapisljiva.
zh_tw: 資料庫檔案「%1」無法寫入。

# KDbConnection|
source: Database "%1" has been created but could not be closed after creation.
ar: أنشئ قاعدة البيانات «%1» لكن لا أستطيع إغلاقها بعد الإنشاء.
az: "%1" verilənlər bazası yaradıldı, lakin, yaradıldıqdan sonra bağlana bilmədi.
el: Η βάση δεδομένων «%1» έχει δημιουργηθεί αλλά δεν θα κλείσει αφού δημιουργηθεί.
eo: La datumbazo "%1" estis kreita sed ne eblis fermi post kreo.
et: Andmebaas "%1" on loodud, kuid pärast loomist ei saanud seda sulgeda.
eu: "%1" datu-basea sortu da baino sortu ondoren ezin izan da itxi.
ka: ბაზა "%1" შეიქმნა, მაგრამ შექმნის შემდეგ მისი დახურვა შეცდომით დასრულდა.
ru: База данных «%1» создана, но её не удалось закрыть после создания.
sl: Podatkovna zbirka "%1" je bila ustvarjena, vendar je po tem ni bilo več mogoče zapreti.
zh_tw: 資料庫「%1」已建立，但在建立後無法關閉。

# KDbConnection|
source: Database "%1" already exists.
ar: قاعدة البيانات «%1» موجودة بالفعل.
az: "%1" verilənlər bazası artıq mövcuddur.
el: Η βάση δεδομένων «%1» υπάρχει ήδη.
eo: La datumbazo "%1" jam ekzistas.
et: Andmebaas "%1" on juba olemas.
eu: "%1" datu-basea jada existitzen da.
ka: ბაზა "%1" უკვე არსებობს.
ru: База данных «%1» уже существует.
sl: Baza podatkov "%1" že obstaja.
zh_tw: 資料庫「%1」已存在。

# KDbConnection|
source: Could not create database "%1". This name is reserved for system database.
ar: لا أستطيع إنشاء قاعدة البيانات «%1». هذا الاسم محجوز لقاعدة بيانات النظام.
az: "%1" verilənlər bazası yaradıla bilmədi. Bu ad sistem verilənlər bazası üçün qorunur.
el: Αδυναμία δημιουργίας της βάσης δεδομένων «%1». Αυτό το όνομα έχει διατηρηθεί για τη βάση δεδομένων στου συστήματος.
eo: Ne eblis krei datumbazon "%1". Ĉi tiu nomo estas rezervita por sistema datumbazo.
et: Andmebaasi "%1" loomine nurjus. See nimi on reserveeritud süsteemi andmebaasile.
eu: Ezin izan da "%1" datu-basea sortu. Izen hau sistemako datu-baserako erreserbatua dago.
ka: ბაზის "%1" შექმნის შეცდომა. ეს სახელი სისტემური ბაზებისთვისაა დაკავებული.
ru: Не удалось создать базу данных «%1». Это имя зарезервировано для системной базы данных.
sl: Ni bilo mogoče ustvariti baze podatkov "%1". To ime je rezervirano za sistem baze.
zh_tw: 無法建立資料庫「%1」。這個名稱已保留給系統資料庫使用。

# KDbConnection|
source: Error creating database "%1" on the server.
ar: خطأ عند إنشاء قاعدة البيانات «%1» على الخادوم.
az: Serverd ə "%1" verilənlər bazasının yaradılması xətası.
el: Σφάλμα δημιουργίας της βάσης δεδομένων «%1» στον εξυπηρετητή.
eo: Eraro dum kreado de datumbazo "%1" sur la servilo.
et: Tõrge andmebaasi "%1" loomisel serveris.
eu: Errorea "%1" zerbitzarian datu-basea sortzean.
ka: სერვერზე ბაზის ("%1") შექმნის შეცდომა.
ru: Ошибка создания базы данных «%1» на сервере.
sl: Napaka pri ustvarjanju baze podatkov "%1" na strežniku.
zh_tw: 在伺服器上建立資料庫「%1」時發生錯誤。

# KDbConnection|
source: Database "%1" has been created but could not be opened.
ar: أنشئ قاعدة البيانات «%1» لكن لا أستطيع فتحها.
az: "%1" verilənlər bazası yaradıldı, lakin, açıla bilmədi.
el: Η βάση δεδομένων «%1» έχει δημιουργηθεί αλλά δεν ανοίγει.
eo: La datumbazo "%1" estis kreita sed ne eblis malfermi.
et: Andmebaas "%1" on loodud, kuid selle avamine nurjus.
eu: "%1" datu-basea sortu da baino ezin da ireki.
ka: მონაცემთა ბაზა "%1" წარმატებით შეიქმნა, მაგრამ მისი გახსნა შეუძლებელია.
ru: База данных «%1» создана, но её не удалось открыть.
sl: Podatkovna baza "%1" je bila ustvarjena, vendar je ni bilo mogoče odpreti.
zh_tw: 資料庫「%1」已建立，但無法開啟。

# KDbConnection|
source: Opening database "%1" failed.
ar: فشل فتح قاعدة البيانات «%1».
az: "%1" verilənlər bazası açıla bilmədi.
el: Αποτυχία ανοίγματος της βάσης δεδομένων «%1».
eo: Malfermo de datumbazo "%1" malsukcesis.
et: Andmebaasi "%1" avamine nurjus.
eu: "%1" datu-basea irekitzea huts egin du.
ka: მონაცემთა ბაზის "%1" გახსნის შეცდომა.
ru: Не удалось открыть базу данных «%1».
sl: Odpiranje podatkovne baze "%1" ni uspelo.
zh_tw: 開啟資料庫「%1」已失敗。

# KDbConnection|
source: Could not find any database for temporary connection.
ar: لا أجد أي قاعدة بيانات لاتصال مؤقت.
az: Müvəqqəti bağlantı üçün hər hansı verilənlər bazası tapılmadı.
el: Αδυναμία εύρεσης βάσης δεδομένων για προσωρινή σύνδεση.
eo: Ne eblis trovi ajnan datumbazon por provizora konekto.
et: Ajutisele ühendusele ei leitud ühtegi andmebaasi.
eu: Ezin da datu-base bat ere aurkitu aldi baterako konexio baterako.
ka: დროებით მისაერთებლად ბაზა ვერ ვიპოვე.
ru: Не удалось найти базу данных для временного соединения.
sl: Pri začasni povezavi ni bilo mogoče najti nobene baze podatkov.
zh_tw: 找不到任何暫時連線用的資料庫。
