Repository: KDE/kdb
Catalog: poqm/*/kdb_qt.po
Languages: ar, az, el, eo, et, eu, ka, ru, sl, zh_tw

# KDbBinaryExpressionData|
source: Incompatible types of arguments
ar: أنواع وسائط غير متوافقة
az: Uyğun olmayan arqument növləri
el: Ασύμβατοι τύποι ορισμάτων
eo: Nekongruaj specoj de argumentoj
et: Argumentide tüübid ei sobi kokku
eu: Argumentu mota bateraezinak
ka: არგუმენტების შეუთავსებელი ტიპები
ru: Несовместимые типы параметров
sl: Nezdružljive vrste argumentov
zh_tw: 參數型態不相容

# KDbBinaryExpressionData|Binary expression arguments type error
source: Expression "%1" requires compatible types of arguments. Specified arguments are of type %2 and %3.
ar: يتطلب التعبير الثنائي «%1» أنواع وسائط متوافقة. أنواع الوسائط المحددة هي %2 و %3.
az: "%1" ifadəsi uyğun arqument növləri tələb edir. Göstərilən arqumentlər %2 və %3 növlüdür.
el: Η έκφραση «%1» απαιτεί συμβατούς τύπους ορισμάτων. Τα δοσμένα ορίσματα είναι τύπου %2 και %3.
eo: Esprimo "%1" postulas kongruajn tipojn de argumentoj. Specifitaj argumentoj estas de tipo %2 kaj %3.
et: Avaldis "%1" nõuab argumenditüüpide sobivust. Määratud argumentide tüübid on %2 ja %3.
eu: "%1" adierazpenak argumentu mota bateragarriak behar ditu. Zehaztutako argumentuak %2 eta %3 motakoak dira.
ka: გამოსახულებას "%1" არგუმენტების თავსებადი ტიპები ესაჭიროება. მითითებული არგუმენტების ტიპებია %2 და %3.
ru: Для выражения «%1» требуются параметры совместимых типов. Указанные параметры относятся к типам %2 и %3.
sl: Izraz "%1" zahteva združljive vrste argumentov. Določeni argumenti so tipa %2 in %3.
zh_tw: 表達式「%1」要求參數型態必須相容。指定的參數的型態是 %2 和 %3。

# MinMaxFunctionDeclaration|
source: Incompatible types in %1() function
ar: أنواع غير متوافقة في الدالة %1()
az: %1() funksiyasında uyğunsuz növlər
el: Ασύμβατοι τύποι στη συνάρτηση %1()
eo: Nekongruaj tipoj en %1() funkcio
et: Sobimatud tüübid %1() funktsioonis
eu: Mota bateraezinak %1() funtzioan
ka: არგუმენტების შეუთავსებელი ტიპები ფუნქციაში %1()
ru: Несовместимые типы в функции %1()
sl: Nezdružljive vrste v funkciji %1()
zh_tw: %1() 函式中的型態不相容

# MinMaxFunctionDeclaration|
source: Argument #%1 of type "%2" in function %3() is not compatible with previous arguments of type "%4".
ar: الوسيط #%1 من النوع «%2» في الدالة %3() غير متوافق مع الوسائط السابقة من النوع «%4».
az: %3() funksiyasındakı "%2" növünün #%1 arumenti, əvvəlki "%4" növü arqumentləri ilə uyğun deyil.
el: Το όρισμα #%1 τύπου «%2» στη συνάρτηση %3() δεν είναι συμβατό με τα προηγούμενα ορίσματα τύπου «%4».
eo: Argumento #%1 de tipo "%2" en funkcio %3() ne kongruas kun antaŭaj argumentoj de tipo "%4".
et: Argument #%1 tüübiga "%2" funktsioonis %3() ei sobi kokku eelmiste argumentidega, mille tüüp on "%4".
eu: %1 zk. argumentua, "%2" motakoa %3() funtzioan, ez da bateragarria "%4" motako aurreko argumentuekin.
ka: არგუმენტი #%1 ტიპით "%2" ფუნქციაში %3() წინა არგუმენტთან, ტიპით "%4" თავსებადი არაა.
ru: Параметр #%1 типа «%2» в функции %3() несовместим с предыдущими параметрами типа «%4».
sl: Argument #%1 vrste "%2" v funkciji %3() ni združljiv s prejšnjimi argumenti vrste "%4".
zh_tw: 函式 %3() 中的第 %1 個參數（型態為「%2」）與在它之前的參數（型態為「%4」）不相容。

# RandomFunctionDeclaration|
source: Invalid arguments of %1() function
ar: وسائط غير صالحة للدالة %1()
az: %1() funksiyasının səhv arqumentləri
el: Μη έγκυρα ορίσματα της συνάρτησης %1()
eo: Nevalidaj argumentoj de %1() funkcio
et: %1() funktsiooni vigased argumendid
eu: %1() funtzioko argumentu baliogabeak
ka: არასწორი არგუმენტები ფუნქციისთვის %1()
ru: Недопустимые параметры функции %1()
sl: Neveljavni argumenti funkcije %1()
zh_tw: %1() 函式的參數不相容

# RandomFunctionDeclaration|
source: Value of the first argument should be less than value of the second argument.
ar: يجب أن تكون قيمة الوسيط الأول أصغر من قيمة الوسيط الثاني.
az: Birinci arqumentin dəyəri ikinci arqumentin dəyərindən az olmalıdır.
el: Η τιμή του πρώτου ορίσματος πρέπει να είναι μικρότερη από την τιμή του δεύτερου ορίσματος.
eo: Valoro de la unua argumento devus esti malpli ol valoro de la dua argumento.
et: Esimese argumendi väärtus peab olema väiksem kui teise argumendi väärtus.
eu: Lehenengo argumentuko balioa bigarren argumentuko balioa baino txikiagoa izan behar du.
ka: პირველი არგუმენტის მნიშვნელობა მეორე არგუმენტის მნიშვნელობაზე ნაკლები უნდა იყოს.
ru: Значение первого параметра должно быть меньше значения второго параметра.
sl: Vrednost prvega argumenta mora biti manjša od vrednosti drugega argumenta.
zh_tw: 第一個參數的值必須小於第二個參數的值。

# KDbFunctionExpressionData|
source: Incorrect number of arguments (%1)
ar: عدد غير صحيح من الوسائط (%1)
az: Yalnız arqument sayı (%1)
el: Λανθασμένο πλήθος ορισμάτων (%1)
eo: Malĝusta nombro da argumentoj (%1)
et: Argumentide arv on vale (%1)
eu: Argumentu kopuru ezegokia (%1)
ka: არგუმენტების არასწორი რაოდენობა (%1)
ru: Неверное количество параметров (%1)
sl: Nepravilno število argumentov (%1)
zh_tw: 參數數量不正確 (%1)

# KDbFunctionExpressionData|don't use space before %1
source: Too many arguments.%1
ar: وسائط كثيرة جدًّا.%1
az: Həddindən çox arqumentlər.%1
el: Πάρα πολλά ορίσματα.%1
eo: Tro da argumentoj.%1
et: Liiga palju argumente.%1
eu: Argumentu gehiegi.%1
ka: მეტისმეტად ბევრი არგუმენტი. %1
ru: Слишком много параметров.%1
sl: Preveč argumentov.%1
zh_tw: 太多參數。%1

# KDbFunctionExpressionData|don't use space before %1
source: Too few arguments.%1
ar: وسائط قليلة جدًّا.%1
az: Şox az arqument.%1
el: Πολύ λίγα ορίσματα.%1
eo: Tro malmultaj argumentoj.%1
et: Liiga vähe argumente.%1
eu: Argumentu gutxiegi.%1
ka: არასაკმარისი არგუმენტები. %1
ru: Слишком мало параметров.%1
sl: Premalo argumentov.%1
zh_tw: 太少參數。%1

# KDbFunctionExpressionData|
source: %1%2() function does not accept any arguments.
ar: الدالة %1%2() لا تقبل أي وسائط.
az: %1%2() funksiyası heç bir arqumenti qəbul etmir.
el: Η συνάρτηση %1%2() δεν δέχεται ορίσματα.
eo: %1%2() funkcio ne akceptas iujn ajn argumentojn.
et: %1%2() funktsioon ei aktsepteeri ühtegi argumenti.
eu: %1%2() funtzioak ez du argumenturik onartzen.
ka: %1%2() ფუნქციას არგუმენტები არ გადაეცემა.
ru: Функция %1%2() не принимает параметров.
sl: Funkcija %1%2() ne sprejema nobenih argumentov.
zh_tw: %1%2() 函式不接受任何參數。

# KDbFunctionExpressionData|
source: %1%2() function requires 1 argument.
ar: تتطلب الدالة %1%2() وسيطًا واحدًا.
az: %1%2() funksiyası 1 arqument tələb edir
el: Η συνάρτηση %1%2() απαιτεί 1 όρισμα.
eo: %1%2() funkcio postulas 1 argumenton.
et: %1%2() funktsioon nõuab 1 argumenti.
eu: %1%2() funtzioak argumentu 1 behar du.
ka: %1%2() ფუნქციას 1 არგუმენტი ესაჭიროება.
ru: Для функции %1%2() требуется 1 параметр.
sl: Funkcija %1%2() sprejema 1 argument.
zh_tw: %1%2() 函式要求要有 1 個參數。

# KDbFunctionExpressionData|
source: %1%2() function requires %3 argument(s).
ar: تتطلب الدالة %1%2() %3 وسائط.
az: %1%2() %3 arqument tələb edir
el: Η συνάρτηση %1%2() απαιτεί πλήθος ορισμάτων %3.
eo: funkcio %1%2() bezonas %3 argumenton.
et: %1%2() funktsioon nõuab %3 argumenti.
eu: %1%2() funtzioak argumentu %3 behar du.
ka: %1%2() ფუნქციას %3 არგუმენტი ესაჭიროება.
ru: Для функции %1%2() требуются параметры (%3).
sl: Funkcija %1%2() zahteva %3 argument.
zh_tw: %1%2() 函式要求要有 %3 個參數。

# KDbFunctionExpressionData|the function requires zero or one argument
source: %1%2() function requires 0 or 1 argument.
ar: تتطلب الدالة %1%2() ٠ أو ١ وسيطًا.
az: %1%2() funksiyası 0 və ya 1 arqument tələb edir.
el: Η συνάρτηση %1%2() απαιτεί 0 ή 1 όρισμα.
eo: %1%2() funkcio postulas 0 aŭ 1 argumento.
et: %1%2() funktsioon nõuab 0 või 1 argumenti.
eu: %1%2() funtzioak 0 edo 1 argumentu behar ditu.
ka: %1%2() ფუნქციას 0 ან 1 არგუმენტი ესაჭიროება.
ru: Для функции %1%2() требуется 0 или 1 параметр.
sl: Funkcija %1%2() zahteva 0 ali 1 argument.
zh_tw: %1%2() 函式只接受 0 或 1 個參數。

# KDbFunctionExpressionData|
source: %1%2() function requires %3 or %4 argument(s).
ar: تتطلب الدالة %1%2() %3 أو %4 وسائط.
az: %1%2() funksiyası %3 və ya %4 arqument tələb edir.
el: Η συνάρτηση %1%2() απαιτεί πλήθος ορισμάτων %3 ή %4.
eo: funkcio %1%2() bezonas %3 aŭ %4 argumento(j)n.
et: %1%2() funktsioon nõuab %3 või %4 argumenti.
eu: %1%2() funtzioak %3 edo %4 argumentu behar ditu.
ka: %1%2() ფუნქციას %3 ან %4 არგუმენტი ესაჭიროება.
ru: Для функции %1%2() требуются параметры (%3 или %4).
sl: Funkcija %1%2() zahteva %3 ali %4 argument.
zh_tw: %1%2() 函式只接受 %3 或 %4 個參數。

# KDbFunctionExpressionData|
source: %1%2() function requires %3 or %4 or %5 argument(s).
ar: تتطلب الدالة %1%2() %3 أو %4 أو %5 وسائط.
az: %1%2() funksiyası %3 %4 və ya %5 arqument tələb edir.
el: Η συνάρτηση %1%2() απαιτεί πλήθος ορισμάτων %3 ή %4 ή %5.
eo: funkcio %1%2() bezonas %3 aŭ %4 aŭ %5 argumento(j)n.
et: %1%2() funktsioon nõuab %3 või %4 või %5 argumenti.
eu: %1%2() funtzioak %3 edo %4 edo %5 argumentu behar ditu.
ka: %1%2() ფუნქციას %3, %4 ან %5 არგუმენტი ესაჭიროება.
ru: Для функции %1%2() требуются параметры (%3 или %4, или %5).
sl: Funkcija %1%2() zahteva %3 ali %4 ali %5 argument.
zh_tw: %1%2() 函式只接受 %3 或 %4 或 %5 個參數。

# KDbFunctionExpressionData|
source: %1 or %2
ar: %1 أو %2
az: %1 və ya %2
el: %1 ή %2
eo: %1 aŭ %2
et: %1 või %2
eu: %1 edo %2
ka: %1 ან %2
ru: %1 или %2
zh_tw: %1 或 %2

# KDbFunctionExpressionData|
source: or
ar: أو
az: və ya
el: ή
eo: aŭ
et: või
eu: edo
ka: ან
ru: или
sl: ali
zh_tw: 或

# KDbFunctionExpressionData|
source: "Number"
ar: «رقم»
az: "Say"
el: «Πλήθος»
eo: "Nombro"
et: "Arv"
eu: «Zenbakia»
ka: "რიცხვი"
ru: «Число»
sl: "Število"
zh_tw: 「數字」

# KDbFunctionExpressionData|Any data type
source: "Any"
ar: «أي»
az: "İstənilən"
el: «Οποιοσδήποτε»
eo: "Iu ajn"
et: "Suvaline"
eu: «Edozein»
ka: "ნებისმიერი"
ru: «Любой»
sl: "Kakršnokoli"
zh_tw: 「任何」

# KDbFunctionExpressionData|
source: Incorrect type of argument
ar: نوع غير صحيح للوسيط
az: Yalnız arqument növü
el: Λανθασμένος τύπος ορίσματος
eo: Malĝusta tipo de argumento
et: Vale argumendi tüüp
eu: Okerreko argumentu mota
ka: არგუმენტის არასწორი ტიპი
ru: Недопустимый тип параметра
sl: Neveljavna vrsta argumenta
zh_tw: 參數型態不正確

# KDbFunctionExpressionData|
source: Specified argument is of type "%1".
ar: الوسيط المحدد من النوع «%1».
az: Göstərilən arqument "%1" növüdür.
el: Το δοσμένο όρισμα είναι τύπου «%1».
eo: Specifita argumento estas de tipo "%1".
et: Määratud argumendi tüüp on "%1".
eu: Zehaztutako argumentua "%1" motakoa da.
ka: მითითებული არგუმენტის ტიპია "%1".
ru: Указанный параметр относится к типу «%1».
sl: Določen argument je vrste "%1".
zh_tw: 指定的參數的型態為「%1」。

# KDbFunctionExpressionData|
source: %1() function's first argument should be of type %2. %3
ar: يجب أن يكون الوسيط الأول للدالة %1() من النوع %2. %3
az: %1() funksiyasının birinci arqumenti %2 növü olmalıdır. %3
el: Το πρώτο όρισμα της συνάρτησης %1() πρέπει να είναι τύπου %2. %3
eo: La unua argumento de la funkcio %1() devus esti de tipo %2. %3
et: %1() funktsiooni esimese argumendi tüüp peab olema %2. %3
eu: %1() funtzioko lehen argumentua %2 motakoa izan beharko litzateke. %3
ka: %1() ფუნქციის პირველი არგუმენტის ტიპი %2 უნდა იყოს. %3
ru: Первый параметр функции %1() должен относиться к типу %2. %3
sl: Prvi argument funkcije %1() mora biti vrste %2. %3
zh_tw: %1() 函式的第一個參數型態應為 %2。%3

# KDbFunctionExpressionData|
source: %1() function's second argument should be of type %2. %3
ar: يجب أن يكون الوسيط الثاني للدالة %1() من النوع %2. %3
az: %1() funksiyasının ikinci arqumenti %2 növü olmalıdır. %3
el: Το δεύτερο όρισμα της συνάρτησης %1() πρέπει να είναι τύπου %2. %3
eo: La dua argumento de %1() funkcio devus esti de tipo %2. %3
et: %1() funktsiooni teise argumendi tüüp peab olema %2. %3
eu: %1() funtzioko bigarren argumentua %2 motakoa izan beharko litzateke. %3
ka: %1() ფუნქციის მეორე არგუმენტის ტიპი %2 უნდა იყოს. %3
ru: Второй параметр функции %1() должен относиться к типу %2. %3
sl: Drugi argument funkcije %1() mora biti vrste %2. %3
zh_tw: %1() 函式的第二個參數型態應為 %2。%3

# KDbFunctionExpressionData|
source: %1() function's third argument should be of type %2. %3
ar: يجب أن يكون الوسيط الثالث للدالة %1() من النوع %2. %3
az: %1() funksiyasının üçüncü arqumenti %2 növü olmalıdır. %3
el: Το τρίτο όρισμα της συνάρτησης %1() πρέπει να είναι τύπου %2. %3
eo: La tria argumento de %1() funkcio devus esti de tipo %2. %3
et: %1() funktsiooni kolmanda argumendi tüüp peab olema %2. %3
eu: %1() funtzioko hirugarren argumentua %2 motakoa izan beharko litzateke. %3
ka: %1() ფუნქციის მესამე არგუმენტის ტიპი %2 უნდა იყოს. %3
ru: Третий параметр функции %1() должен относиться к типу %2. %3
sl: Tretji argument funkcije %1() mora biti vrste %2. %3
zh_tw: %1() 函式的第三個參數型態應為 %2。%3

# KDbFunctionExpressionData|
source: %1() function's fourth argument should be of type %2. %3
ar: يجب أن يكون الوسيط الرابع للدالة %1() من النوع %2. %3
az: %1() funksiyasının dördüncü arqumenti %2 növü olmalıdır. %3
el: Το τέταρτο όρισμα της συνάρτησης %1() πρέπει να είναι τύπου %2. %3
eo: La kvara argumento de la funkcio %1() devus esti de tipo %2. %3
et: %1() funktsiooni neljanda argumendi tüüp peab olema %2. %3
eu: %1() funtzioko laugarren argumentua %2 motakoa izan beharko litzateke. %3
ka: %1() ფუნქციის მეოთხე არგუმენტის ტიპი %2 უნდა იყოს. %3
ru: Четвёртый параметр функции %1() должен относиться к типу %2. %3
sl: Četrti argument funkcije %1() mora biti vrste %2. %3
zh_tw: %1() 函式的第四個參數型態應為 %2。%3

# KDbFunctionExpressionData|
source: %1() function's fifth argument should be of type %2. %3
ar: يجب أن يكون الوسيط الخامس للدالة %1() من النوع %2. %3
az: %1() funksiyasının beşinci arqumenti %2 növü olmalıdır. %3
el: Το πέμπτο όρισμα της συνάρτησης %1() πρέπει να είναι τύπου %2. %3
eo: La kvina argumento de la funkcio %1() devus esti de tipo %2. %3
et: %1() funktsiooni viienda argumendi tüüp peab olema %2. %3
eu: %1() funtzioko bosgarren argumentua %2 motakoa izan beharko litzateke. %3
ka: %1() ფუნქციის მეხუთე არგუმენტის ტიპი %2 უნდა იყოს. %3
ru: Пятый параметр функции %1() должен относиться к типу %2. %3
sl: Peti argument funkcije %1() mora biti vrste %2. %3
zh_tw: %1() 函式的第五個參數型態應為 %2。%3

# KDbFunctionExpressionData|
source: %1() function's %2 argument should be of type %3. %4
ar: يجب أن يكون الوسيط %2 للدالة %1() من النوع %3. %4
az: %1() funksiyasının %2 arqumenti %3 növü olmalıdır. %4
el: Το %2 όρισμα της συνάρτησης %1 πρέπει να είναι τύπου %3. %4
eo: La argumento %2 de %1() funkcio devus esti de tipo %3. %4
et: %1() funktsiooni %2. argumendi tüüp peab olema %3. %4
eu: %1() funtzioko %2. argumentua %3 motakoa izan beharko litzateke. %4
ka: %1() ფუნქციის %2-ე არგუმენტის ტიპი %3 უნდა იყოს. %4
ru: %2 по счёту параметр функции %1() должен относиться к типу %3. %4
sl: Od %1() funkcije %2 argument mora biti vrste %3. %4
zh_tw: %1() 函式的第 %2 個參數型態應為 %3。%4

# KDbFunctionExpressionData|
source: Too many arguments for function.
ar: وسائط كثيرة جدًّا للدالة.
az: Funksiya üçün həddindən çox arqumentlər var.
el: Πάρα πολλά ορίσματα για τη συνάρτηση.
eo: Tro da argumentoj por funkcio.
et: Funktsioonil on liiga palju argumente.
eu: Funtzioarentzako argumentu gehiegi.
ka: ფუნქციის მეტისმეტად ბევრი არგუმენტი.
ru: Слишком много параметров для функции.
sl: Preveč argumentov funkcije.
zh_tw: 函式太多參數。

# KDbFunctionExpressionData|
source: Maximum number of arguments for function %1() is %2.
ar: العدد الأقصى من الوسائط للدالة %1() هو %2.
az: %1 funksiyası üçün arqumentlərin maksimum sayı %2.
el: Το μέγιστο πλήθος ορισμάτων για τη συνάρτηση %1() είναι %2.
eo: Maksimuma nombro da argumentoj por funkcio %1() estas %2.
et: Funktsiooni %1() maksimaalne argumentide arv on %2.
eu: %1() funtzioak gehienez onartzen duen argumentu kopurua %2 da.
ka: %1() ფუნქციის არგუმენტების მაქსიმალური რიცხვია %2.
ru: Максимальное число параметров для функции %1() — %2.
sl: Največje število argumentov funkcije %1() je %2.
zh_tw: 函式 %1() 最多的參數數量為 %2。

# KDbFunctionExpressionData|
source: Too few arguments. %1() function requires at least one argument.
ar: وسائط قليلة جدًّا. تتطلب الدالة %1() وسيطًا واحدًا على الأقل.
az: Arqumentlər həddindən azdır. %1 funksiyası ən azı %1() arqument tələb edir.
el: Πολύ λίγα ορίσματα. Η συνάρτηση %1() απαιτεί τουλάχιστον ένα όρισμα.
eo: Tro malmultaj argumentoj. %1() funkcio postulas almenaŭ unu argumenton.
et: Liiga vähe argumente. %1() funktsioon nõuab vähemalt üht argumenti.
eu: Argumentu gutxiegi. %1() funtzioak gutxienez argumentu bat behar du.
ka: მეტისმეტად ცოტა არგუმენტი. %1() ფუნქციას, სულ ცოტა, ერთი არგუმენტი ესაჭიროება.
ru: Слишком мало параметров. Функция %1() требует не менее одного параметра.
sl: Premalo argumentov. Funkcija %1() zahteva vsaj en argument.
zh_tw: 太少參數。%1() 函式要求必須要至少有 1 個參數。

# KDbFunctionExpressionData|
source: Too few arguments. %1() function requires at least two arguments.
ar: وسائط قليلة جدًّا. تتطلب الدالة %1() وسيطَين على الأقل.
az: Arqumentlər həddindən azdır. %1() funksiyası ən azı iki arqument tələb edir.
el: Πολύ λίγα ορίσματα. Η συνάρτηση %1() απαιτεί τουλάχιστον δύο ορίσματα.
eo: Tro malmultaj argumentoj. %1() funkcio postulas almenaŭ du argumentojn.
et: Liiga vähe argumente. %1() funktsioon nõuab vähemalt kaht argumenti.
eu: Argumentu gutxiegi. %1() funtzioak gutxienez bi argumentu behar ditu.
ka: მეტისმეტად ცოტა არგუმენტი. %1() ფუნქციას, სულ ცოტა, ორი არგუმენტი ესაჭიროება.
ru: Слишком мало параметров. Функция %1() требует не менее двух параметров.
sl: Premalo argumentov. Funkcija %1() zahteva vsaj dva argumenta.
zh_tw: 太少參數。%1() 函式要求必須要至少有 2 個參數。

# KDbFunctionExpressionData|
source: Too few arguments. %1() function requires at least three arguments.
ar: وسائط قليلة جدًّا. تتطلب الدالة %1() ثلاثة وسائط على الأقل.
az: Arqumentlər həddindən azdır. %1() funksiyası ən azı üç arqument tələb edir.
el: Πολύ λίγα ορίσματα. Η συνάρτηση %1() απαιτεί τουλάχιστον τρία ορίσματα.
eo: Tro malmultaj argumentoj. %1() funkcio postulas almenaŭ tri argumentojn.
et: Liiga vähe argumente. %1() funktsioon nõuab vähemalt kolme argumenti.
eu: Argumentu gutxiegi. %1() funtzioak gutxienez hiru argumentu behar ditu.
ka: მეტისმეტად ცოტა არგუმენტი. %1() ფუნქციას, სულ ცოტა, სამი არგუმენტი ესაჭიროება.
ru: Слишком мало параметров. Функция %1() требует не менее трёх параметров.
sl: Premalo argumentov. Funkcija %1() zahteva vsaj tri argumente.
zh_tw: 太少參數。%1() 函式要求必須要至少有 3 個參數。

# KDbFunctionExpressionData|
source: Too few arguments. %1() function requires at least %2 arguments.
ar: وسائط قليلة جدًّا. تتطلب الدالة %1() %2 وسائط على الأقل.
az: Arqumentlər həddindən azdır. %1() funksiyası ən azı %2 arqument tələb edir.
el: Πολύ λίγα ορίσματα. Η συνάρτηση %1() απαιτεί τουλάχιστον %2 ορίσματα.
eo: Tro malmultaj argumentoj. %1() funkcio postulas almenaŭ %2 argumentojn.
et: Liiga vähe argumente. %1() funktsioon nõuab vähemalt %2 argumenti.
eu: Argumentu gutxiegi. %1() funtzioak gutxienez %2 argumentu behar ditu.
ka: მეტისმეტად ცოტა არგუმენტი. %1() ფუნქციას, სულ ცოტა, %2 არგუმენტი ესაჭიროება.
ru: Слишком мало параметров. Необходимое количество параметров для функции %1(): не менее %2.
sl: Premalo argumentov. Funkcija %1() zahteva vsaj %2 argumentov.
zh_tw: 太少參數。%1() 函式要求必須要至少有 %2 個參數。

# KDbNArgExpressionData|
source: Three arguments required
ar: تتطلب ثلاثة وسائط
az: Üç arqument tələb olunur
el: Τρία ορίσματα απαιτούνται
eo: Tri argumentoj bezonataj
et: Nõutav on kolm argumenti
eu: Hiru argumentu behar dira
ka: საჭიროა სამი არგუმენტი
ru: Необходимы три параметра
sl: Zahtevani trije argumenti
zh_tw: 需要三個參數

# KDbNArgExpressionData|BETWEEN..AND error
source: %1 operator requires exactly three arguments.
ar: يتطلب العامل %1 ثلاثة وسائط بالضبط.
az: %1 operatoru dəqiq üç arqument tələb edir.
el: Ο τελεστής %1 απαιτεί ακριβώς τρία ορίσματα.
eo: %1 operatoro postulas ekzakte tri argumentojn.
et: %1 operaator nõuab täpselt kolme argumenti.
eu: %1 eragileak zehazki hiru argumentu behar ditu.
ka: %1 ოპერატორს ზუსტად სამი არგუმენტი ესაჭიროება.
ru: Для оператора %1 требуются ровно три параметра.
sl: Operator %1 zahteva natanko tri argumente.
zh_tw: %1 運算子需要剛好三個參數。

# KDbNArgExpressionData|
source: Incompatible types of arguments
ar: أنواع وسائط غير متوافقة
az: Uyğun olmayan arqument növləri
el: Ασύμβατοι τύποι ορισμάτων
eo: Nekongruaj specoj de argumentoj
et: Argumentide tüübid ei sobi kokku
eu: Argumentu mota bateraezinak
ka: არგუმენტების შეუთავსებელი ტიპები
ru: Несовместимые типы параметров
sl: Nezdružljive vrste argumentov
zh_tw: 參數型態不相容

# KDbNArgExpressionData|BETWEEN..AND arguments type error
source: Operator "%1" requires compatible types of arguments. Specified arguments are of type %2, %3, %4.
ar: يتطلب العامل «%1» أنواع وسائط متوافقة. أنواع الوسائط المحددة هي %2 و %3 و %4.
az: "%1" operatoru uyğun arqument növləri tələb edir. Verilmiş arqument növləri, %2, %3, %4
el: Ο τελεστής «%1» απαιτεί συμβατούς τύπους ορισμάτων. Τα δοσμένα ορίσματα είναι τύπου %2, %3, %4.
eo: Operatoro "%1" postulas kongruajn tipojn de argumentoj. Specifitaj argumentoj estas de tipo %2, %3, %4.
et: Operaator "%1" nõuab argumenditüüpide sobivust. Määratud argumentide tüübid on %2, %3, %4.
eu: "%1" eragileak argumentu mota bateragarriak behar ditu. Zehaztutako argumentuak %2, %3 eta %4 motakoak dira.
ka: ოპერატორს "%1" არგუმენტების თავსებადი ტიპები ესაჭიროება. მითითებული არგუმენტების ტიპებია %2, %3 ან %4.
ru: Для оператора «%1» требуются параметры совместимых типов. Указанные параметры относятся к типам %2, %3, %4.
sl: Operator "%1" zahteva združljive vrste argumentov. Določeni argumenti so vrste %2, %3, %4.
zh_tw: 運算子「%1」要求參數型態必須相容。指定的參數的型態是 %2、%3 、%4。

# KDbVariableExpressionData|
source: Ambiguous field name
ar: اسم حقل غامض
az: birmənalı olmayan sahə adı
el: Ασαφές όνομα πεδίου
eo: Ambigua kamponomo
et: Umbmäärane välja nimi
eu: Eremu-izen anbiguoa
ka: ველის არასწორი სახელი
ru: Неоднозначное имя поля
sl: Dvoumno ime polja
zh_tw: 模糊的欄位名稱

# KDbVariableExpressionData|Note: translate also <tableName>
source: Both table "%1" and "%2" have defined "%3" field. Use "<tableName>.%4" notation to specify table name.
ar: كل من الجدولين «%1» و «%2» يعرف الحقل «%3». استخدِم التدوين «<tableName>.%4» لتحديد اسم الجدول.
az: Hər iki, "%1" və "%2" "%3" sahəsini müəyyənləşdirdilər. Cədvəlin adını göstərmək üçün "<tableName>%4" istifadə edin.
el: Και οι δύο πίνακες «%1» και «%2» έχουν ορίσει το πεδίο «%3». Χρησιμοποιείστε το συμβολισμό «<tableName>.%4» για να δηλώσετε το όνομα του πίνακα.
eo: Ambaŭ tabelo "%1" kaj "%2" havas difinitan kampon "%3". Uzu "<tableName>.%4" notacion por specifi tabelnomon.
et: Nii tabel "%1" kui ka "%2" on defineerinud välja "%3". Määra tabeli nimi kujul "<tabeliNimi>.%4.
eu: Biek, "%1" eta "%2" taulek definitu dute "%3" eremua. Erabili "<taulaIzena>.%4" notazioa taula izena zehazteko.
ka: ორივე ცხრილს, "%1" და "%2", "%3" ველი გააჩნიათ. ცხრილის მისათითებლად გამოიყენეთ <ცხრილისსახელი>.%4 ნოტაცია.
ru: Таблицы «%1» и «%2» обе содержат поле «%3». Для указания имени таблицы воспользуйтесь записью «<tableName>.%4».
sl: Obe tabeli "%1" in "%2" vsebujeta polji "%3". Uporabite notacijo "<tableName>.%4" za določanje imen tabel.
zh_tw: 表格「%1」和「%2」都有定義名為「%3」的欄位。請使用 "<表格名稱>.%4" 語法來指定表格名稱。

# KDbVariableExpressionData|
source: Field not found
ar: الحقل غير موجود
az: Sahə tapılmadı
el: Το πεδίο δε βρέθηκε
eo: Kampo ne trovita
et: Välja ei leitud
eu: Eremua ez da aurkitu
ka: ველი არ არსებობს
ru: Поле не найдено
sl: Polja ni mogoče najti
zh_tw: 找不到欄位

# KDbVariableExpressionData|
source: Could not find table containing field "%1".
ar: لا أجد جدولًا يحتوي على الحقل «%1».
az: Cədvəl tərkibindəki "%1" sahəsi tapılmadı.
el: Αδυναμία εύρεσης πίνακα που να περιέχει το πεδίο «%1».
eo: Ne eblis trovi tabelon enhavantan kampon "%1".
et: Tabelit, mis sisaldaks välja "%1", ei leitud.
eu: Ezin izan da aurkitu "%1" eremua duen taula.
ka: ცხრილი, რომელიც ველს "%1" შეიცავს, ვერ ვიპოვე.
ru: Не удалось таблицу, содержащую поле «%1».
sl: Ni mogoče najti tabele, ki vsebuje polje "%1".
zh_tw: 找不到包含欄位「%1」的表格。
