Repository: KDE/kdb
Catalog: poqm/*/kdb_qt.po
Languages: ar, az, el, eo, et, eu, ka, ru, sl, zh_tw

# KDbConnection|
source: Record inserting on the server failed.
ar: فشل إدراج السجل على الخادوم.
az: Yazının serverə əlavə edilməsi baş tutmadı.
el: Αποτυχία εισαγωγής εγγραφής στον εξυπηρετητή.
eo: Enmetado de rikordo en la servilo malsukcesis.
et: Kirje lisamine serveris nurjus.
eu: Zerbitzarian erregistro sartzea huts egin du.
ka: სერვერზე ჩანაწერის ჩასმის შეცდომა.
ru: Не удалось вставить запись на сервере.
sl: Vstavljanje zapisa na strežniku ni uspelo.
zh_tw: 伺服器上的紀錄插入失敗。

# KDbConnection|
source: Could not delete record because there is no master table specified.
ar: لا أستطيع حذف السجل لأنه لم يحدد جدول رئيسي.
az: Yazı silinə bilmədi, çünki əsas cədvəl göstərilməyib.
el: Αδυναμία διαγραφής εγγραφής επειδή δεν έχει ορισθεί κύριος πίνακας.
eo: Ne eblis forigi rikordon ĉar ne estas specifita majstra tabelo.
et: Kirjet ei saanud kustutada, sest peatabel on määramata.
eu: Ezin izan da erregistroa ezabatu taula nagusirik zehaztu ez delako.
ka: ჩანაწერის წაშლა შეუძლებელია, რადგან მთავარი ცხრილი აღწერილი არაა.
ru: Не удалось удалить запись, так как не задана главная таблица.
sl: Zapisa ni mogoče izbrisati, ker ni določena glavna tabela.
zh_tw: 無法刪除紀錄，因為沒有指定主表格。

# KDbConnection|
source: Could not delete record because there is no primary key for master table specified.
ar: لا أستطيع حذف السجل لأنه لم يحدد مفتاح أساسي للجدول الرئيسي.
az: Yazı silinə bilmədi, çünki, əsas cədvəl üçün ilkin açar göstərilməyib.
el: Αδυναμία διαγραφής εγγραφής επειδή δεν έχει ορισθεί πρωτεύον κλειδί στον κύριο πίνακα.
eo: Ne eblis forigi rikordon ĉar ne estas specifita ĉefa ŝlosilo por majstra tabelo.
et: Kirjet ei saanud kustutada, sest peatabeli primaarvõti on määramata.
eu: Ezin izan da erregistroa ezabatu taula nagusiko lehen mailako gakorik zehaztu ez delako.
ka: ჩანაწერის წაშლა შეუძლებელია, რადგან მთავარ ცხრილს ძირითადი გასაღები აღწერილი არ აქვს.
ru: Не удалось удалить запись, так как не задан первичный ключ главной таблицы.
sl: Zapisa ni mogoče izbrisati, ker ni določen primarni ključ glavne tabele.
zh_tw: 無法刪除紀錄，因為沒有指定主表格的主鍵值。

# KDbConnection|
source: Could not delete record because it does not contain entire master table's primary key.
ar: لا أستطيع حذف السجل لأنه لا يحتوي على المفتاح الأساسي الكامل للجدول الرئيسي.
az: Yazı silinə bilmədi, çünki, o əsas cədvəlin ilkin açarının tamamından ibarət deyil.
el: Αδυναμία διαγραφής εγγραφής επειδή δεν περιέχει το πλήρες πρωτεύον κλειδί του κύριου πίνακα.
eo: Ne eblis forigi rikordon ĉar ĝi ne enhavas la ĉefan ŝlosilon de tuta ĉeftabelo.
et: Kirjet ei saanud kustutada, sest peatabelil puudub kogu primaarvõti.
eu: Ezin izan da erregistroa ezabatu taula nagusiko lehen mailako gako osorik ez daukalako.
ka: ჩანაწერის წაშლა შეუძლებელია, რადგან ის მთავარი ცხრილის ძირითად გასაღებს სრულად არ შეიცავს.
ru: Не удалось удалить запись, так как она не содержит весь первичный ключ главной таблицы.
sl: Zapisa ni mogoče izbrisati, ker ne vsebuje celotnega primarnega ključa glavne tabele.
zh_tw: 無法刪除紀錄，因為它不包含主表格的整個主鍵值。

# KDbConnection|
source: Record deletion on the server failed.
ar: فشل حذف السجل على الخادوم.
az: Serverdə yazının silinməsi baş tutmadı.
el: Αποτυχία διαγραφής εγγραφής στον εξυπηρετητή.
eo: Rikorda forigo sur la servilo malsukcesis.
et: Kirje kustutamine serveris nurjus.
eu: Zerbitzarian erregistro ezabatzea hus egin du.
ka: სერვერზე ჩანაწერის წაშლის შეცდომა.
ru: Не удалось удалить запись на сервере.
sl: Brisanje zapisa na strežniku ni uspelo.
zh_tw: 伺服器上的紀錄刪除失敗。

# KDbConnection|
source: Unknown error.
ar: خطأ غير معروف.
az: Naməlum xəta.
el: Άγνωστο σφάλμα.
eo: Nekonata eraro.
et: Tundmatu tõrge.
eu: Errore ezezaguna.
ka: უცნობი შეცდომა.
ru: Неизвестная ошибка.
sl: Neznana napaka.
zh_tw: 未知的錯誤。

# KDbConnectionData|
source: <file>
ar: <ملف>
eo: <dosiero>
et: <fail>
eu: <fitxategia>
ka: <ფაილი>
sl: <datoteka>
zh_tw: <檔案>

# KDbConnectionData|
source: file: %1
ar: ملف: %1
az: fayl: %1
el: αρχείο: %1
eo: dosiero: %1
et: fail: %1
eu: fitxategia: %1
ka: ფაილი: %1
ru: файл: %1
sl: datoteka: %1
zh_tw: 檔案：%1

# KDbCursor|
source: No query statement or schema defined.
ar: لم يحدد عبارة استعلام أو مخطط.
az: Heç bir sorğu təlimatı və ya sxem müəyyənləşdirməyib.
el: Δεν έχει ορισθεί ερώτημα ή σχήμα.
eo: Neniu demanda deklaro aŭ skemo difinita.
et: Päringu lauset ega skeemi pole määratud.
eu: Ez da itaun adierazpenik edo eskemarik definitu.
ka: მოთხოვნის ოპერატორი ან სქემა აღწერილი არაა.
ru: Не задано ни выражение запроса, ни схема.
sl: Ni določene poizvedbe ali sheme.
zh_tw: 未定義查詢敘述或綱要。

# KDbCursor|
source: Could not generate query statement.
ar: لا أستطيع توليد عبارة الاستعلام.
az: Sorğu təlimatı yaradıla bilmədi.
el: Αδυναμία παραγωγής ερωτήματος.
eo: Ne eblis generi demandan deklaron.
et: Päringulause genereerimine nurjus.
eu: Ezin izan da itaun adierazpena sortu.
ka: მოთხოვნის ოპერატორის შექმნის შეცდომა.
ru: Не удалось создать выражение запроса.
sl: Ni bilo mogoče ustvariti stavka poizvedbe.
zh_tw: 無法產生查詢敘述。

# KDbCursor|
source: Error opening database cursor.
ar: خطأ عند فتح مؤشر قاعدة البيانات.
az: Verilənlər bazası kursorunun açılmasında xəta.
el: Σφάλμα στο άνοιγμα του δείκτη γραμμής της βάσης δεδομένων.
eo: Eraro malfermante datumbazan kursoron.
et: Tõrge andmebaasikursori avamisel.
eu: Errorea datu-baseko kurtsorea irekitzean.
ka: ბაზის კურსორის გახსნის შეცდომა.
ru: Ошибка открытия курсора базы данных.
sl: Napaka pri odpiranju kazalca baze podatkov.

# KDbCursor|
source: Could not fetch next record.
ar: لا أستطيع جلب السجل التالي.
az: Növbəti yazı alına bilmədi.
el: Αδυναμία ανάκτησης επόμενης εγγραφής.
eo: Ne eblis akiri sekvan rikordon.
et: Järgmise kirje tõmbamine nurjus.
eu: Ezin izan da hurrengo erregistroa ekarri.
ka: შემდეგი ჩანაწერის გამოთხოვის შეცდომა.
ru: Не удалось получить следующую запись.
sl: Ni bilo mogoče pridobiti naslednjega zapisa.
zh_tw: 無法抓取下一個紀錄。

# KDbCursor|
source: No connection for cursor open operation specified.
ar: لم يحدد اتصال لعملية فتح المؤشر.
az: Kursorun açılması əməliyyatı üçün heç bir bağlantı göstərilməyib.
el: Δεν ορίσθηκε σύνδεση για ανοικτή λειοτυργία του δείκτη γραμμής.
eo: Neniu konekto por kursora malferma operacio specifita.
et: Ühtegi ühendust kursori avamise toiminguks ei ole määratud.
eu: Ez da zehaztu kurtsorea irekitzeko eragiketarako konexiorik.
ka: კურსორის გახსნის ოპერაციისთვის მიერთება მითითებული არაა.
ru: Не указано соединение для операции открытия курсора.
sl: Ni določena povezava za odprtje delovanja kazalca.

# KDbDriver|
source: Invalid database driver's "%1" implementation.
ar: تنفيذ مشغل قاعدة بيانات غير صالح «%1».
az: "%1" Verilənlər bazası sürücüsünün səhv icrası.
el: Μη έγκυρη υλοποίηση του οδηγού «%1» βάσης δεδομένων.
eo: Malvalida efektivigo de "%1" de datumbaza pelilo.
et: Vigane andmebaasidraiveri "%1" teostus.
eu: Datu-base gidariko "%1" inplementazio baliogabea.
ka: ბაზის დრაივერის "%1" არასწორი განხორციელება.
ru: Недопустимая реализация драйвера базы данных «%1».
sl: Neveljavna izvedba gonilnika baze podatkov "%1".

# KDbDriver|
source: Value of "%1" is not initialized for the driver.
ar: قيمة «%1» ليست مهيأة للمشغل.
az: "%1" dəyəri sürücü üçün işə salınmadı.
el: Η τιμή του «%1» δεν προετοιμάστηκε για τον οδηγό.
eo: Valoro de "%1" ne estas pravigita por la pelilo.
et: Väärtus "%1" ei ole draiveris initsialiseeritud.
eu: "%1"-(r)en ez da gidariarentzat hasieratu.
ka: დრაივერისთვის "%1"-ის მნიშვნელობა ინიციალიზებული არაა.
ru: Значение «%1» не инициализировано для драйвера.
sl: Vrednost "%1" za gonilnik ni osnovana.

# KDbDriver|
source: Client library version
ar: إصدار مكتبة العميل
az: Kitabxananın müştəri versiyası
el: Έκδοση βιβλιοθήκης πελάτη
eo: Klienta biblioteko versio
et: Kliendi teegi versioon
eu: Bezero liburutegi bertsioa
ka: კლიენტი ბიბლიოთეკის ვერსია
ru: Версия клиентской библиотеки
sl: Različica knjižnice odjemalca

# KDbDriver|
source: Default character encoding on server
ar: ترميز الأحرف المبدئي على الخادوم
az: Serverdə simvolların atandart kodlaşması
el: Προκαθορισμένη κωδικοποίηση χαρακτήρων στον εξυπηρετητή
eo: Defaŭlta signokodigo sur servilo
et: Serveri vaikimisi kodeering
eu: Karaktere kodeketa estandarra zerbitzarian
ka: სერვერის ნაგულისხმები სიმბოლოების კოდირება
ru: Стандартная кодировка символов на сервере
sl: Privzeto kodiranje znakov na strežniku

# KDbDriver|
source: File-based database driver
ar: مشغل قاعدة بيانات مستند إلى ملف
az: Fayı şəklində verilənlər bazası sürücüsü
el: Οδηγός βάσης δεδομένων βαδισμένος σε αρχεία
eo: Dosierbazita datumbaza pelilo
et: Failipõhine andmebaasidraiver
eu: Fitxategi-oinarriko datu-base gidaria
ka: ფაილზე დაფუძლებული ბაზის დრაივერი
ru: Драйвер файловой базы данных
sl: Gonilnik baze podatkov na osnovi datotek

# KDbDriver|
source: File-based database's MIME types
ar: أنواع MIME لقاعدة البيانات المستندة إلى ملف
az: Verilənlər bazasının fayl şəklində MİME növləri
el: MIME τύποι βάση δεδομένων βασισμένοι σε αρχεία
eo: MIME-tipoj de dosierbazita datumbazo
et: Failipõhise andmebaasidraiveri MIME tüübid
eu: Fitxategi-oinarriko datu-baseen MIME motak
ka: ფაილზე-ბაზირებული ბაზის MIME ტიპები
ru: Типы MIME файловой базы данных
sl: MIME datotečne vrste na bazi podatkov

# KDbDriver|
source: Single transactions support
ar: دعم المعاملات المفردة
az: Tək əməliyyat dəstəyi
el: Υποστήριξη μεμονωμένης συναλλαγής
eo: Unuopaj transakcioj subteno
et: Üksiktehingu toetus
eu: Transakzio bakunen euskarria
ka: ერთი ტრანზაქციის მხარდაჭერა
ru: Поддержка одиночных транзакций
sl: Podpora posameznih transakcij

# KDbDriver|
source: Multiple transactions support
ar: دعم المعاملات المتعددة
az: Çoxsaylı əməliyyatlar dəstəyi
el: Υποστήριξη πολλών συναλλαγών
eo: Multoblaj transakcioj subtenas
et: Mitme tehingu toetus
eu: Transakzio aniztunen euskarria
ka: მრავალი ტრანზაქციის მხარდაჭერა
ru: Поддержка нескольких транзакций
sl: Podpora za več transakcij

# KDbDriver|
source: Nested transactions support
ar: دعم المعاملات المتداخلة
az: İç-içə əməliyyat dəstəyi
el: Υποστήριξη ένθετων συναλλαγών
eo: Nestitaj transakcioj subtenas
et: Pesastatud tehingute toetus
eu: Habiaratutako transakzioen euskarria
ka: ჩალაგებული ტრანზაქციების მხარდაჭერა
ru: Поддержка вложенных транзакций
sl: Podpora gnezdenih transakcij

# KDbDriver|
source: Ignored transactions support
ar: دعم المعاملات المتجاهلة
az: Nəzərə alınmayan əməliyyatlar dəstəyi
el: Υποστήριξη αγνοημένων συναλλαγών
eo: Subteno de transakcioj ignoritaj
et: Eiratavate tehingute toetus
eu: Ez-ikusitako transakzioen euskarria
ka: იგნორირებული ტრანზაქციის მხარდაჭერა
ru: Поддержка пропущенных транзакций
sl: Podpora prezrtih transakcij

# KDbDriver|
source: KDb driver version
ar: إصدار مشغل KDb
az: KDb sürücüsü versiyası
el: Έκδοση KDb οδηγού
eo: KDb-pelilversio
et: KDb draiveri versioon
eu: KDb gidari bertsioa
ka: KDb დრაივერის ვერსია
ru: Версия драйвера KDb
sl: Različica gonilnikov KDb
zh_tw: KDb 驅動程式版本

# DriverManagerInternal|
source: Could not find any database drivers.
ar: لا أجد أي مشغلات لقاعدة البيانات.
az: Heç bir verilənlər bazası sürücüləri tapılmadı.
el: Αδυναμία εύρεσης οδηγών βάσης δεδομένων.
eo: Ne eblis trovi datumbazajn pelilojn.
et: Ühtegi andmebaasidraiverit ei leitud.
eu: Ezin izan da aurkitu datu-base gidaririk.
ka: ბაზების დრაივერები ვერ ვიპოვე.
ru: Не удалось найти ни одного драйвера базы данных.
sl: Ni bilo mogoče najti nobenih gonilnikov podatkovnih baz.

# DriverManagerInternal|
source: Could not find database driver "%1".
ar: لا أجد مشغل قاعدة البيانات «%1».
az: "%1" verilənlər bazası sürücüsü tapılmadı.
el: Αδυναμία εύρεσης του οδηγού «%1» της βάσης δεδομένων.
eo: Ne eblis trovi datumbazan pelilon "%1".
et: Andmebaasidraiverit "%1" ei leitud.
eu: Ezin izan da aurkitu datu-baseko "%1" gidaria.
ka: ბაზის დრაივერი "%1" ვერ ვიპოვე.
ru: Не удалось найти драйвер базы данных «%1».
sl: Ni bilo mogoče najti gonilnika podatkovne baze "%1".

# DriverManagerInternal|
source: Could not load database driver's plugin file "%1".
ar: لا أستطيع تحميل ملف الملحق لمشغل قاعدة البيانات «%1».
az: "%1" verilənlər bazası sürücü qoşması faylı yüklənə bilmədi.
el: Αδυναμία φόρτωσης του αρχείου προσθέτων «%1» του οδηγού της βάσης δεδομένων.
eo: Ne eblis ŝargi la kromprogramon de datumbaza pelilo "%1".
et: Andmebaasidraiveri pluginafaili "%1" laadimine nurjus.
eu: Ezin izan da zamatu datu-base gidariaren "%1" plugin-fitxategia.
ka: ბაზის დრაივერის დამატების ფაილის "%1" ჩატვირთვის შეცდომა.
ru: Не удалось загрузить файл модуля драйвера базы данных «%1».
sl: Datoteke vtičnika gonilnika baze podatkov "%1" ni bilo mogoče naložiti.

# DriverManagerInternal|
source: Could not open database driver "%1" from plugin file "%2".
ar: لا أستطيع فتح مشغل قاعدة البيانات «%1» من ملف الملحق «%2».
az: "%1" verilənlər bazası sürücüsü "%2" qoşması faylından açıla bilmədi.
el: Αδυναμία ανοίγματος του οδηγού «%1» της βάσης δεδομένων από το αρχείο προσθέτων «%2».
eo: Ne eblis malfermi datumbazan pelilon "%1" de kromprogramo "%2".
et: Andmebaasidraiveri "%1" avamine pluginafailist "%2" nurjus.
eu: Ezin izan da ireki "%1" datu-base gidaria "%2" plugin fitxategitik.
ka: ბაზის დრაივერის "%1" გახსნის შეცდომა დამატების ფაილიდან "%2".
ru: Не удалось открыть драйвер базы данных «%1» из файла модуля «%2».
sl: Ni bilo mogoče odpreti gonilnika baze podatkov "%1" iz datoteke vtičnika "%2".

# KDbField|
source: Invalid Type
ar: نوع غير صالح
az: Səhv növ
el: Μη έγκυρος τύπος
eo: Nevalida Tipo
et: Vigane tüüp
eu: Mota baliogabea
ka: არასწორი ტიპი
ru: Недопустимый тип
sl: Neveljaven tip
zh_tw: 無效型態

# KDbField|
source: Byte
ar: بايت
az: Bayt
eo: Bajto
et: Bait
ka: ბაიტი
ru: Байт
zh_tw: 位元組

# KDbField|
source: Short Integer Number
ar: رقم صحيح قصير
az: Qısa tam say
el: Μικρός ακέραιος
eo: Mallonga Entjera Nombro
et: Lühike täisarv
eu: Zenbaki osoa, laburra
ka: პატარა მთელი რიცხვი
ru: Короткое целое число
sl: Kratko celo število
zh_tw: 短整數

# KDbField|
source: Integer Number
ar: رقم صحيح
az: Tam say
el: Ακέραιςο αριθμός
eo: Entjera Nombro
et: Täisarv
eu: Zenbaki osoa
ka: მთელი რიცხვი
ru: Целое число
sl: Celo število
zh_tw: 整數

# KDbField|
source: Big Integer Number
ar: رقم صحيح كبير
az: Böyük tam say
el: Μεγάλος ακέραιος
eo: Granda Entjera Nombro
et: Suur täisarv
eu: Zenbaki osoa, handia
ka: დიდი მთელი რიცხვი
ru: Длинное целое число
sl: Veliko celo število
zh_tw: 大整數

# KDbField|
source: Yes/No Value
ar: قيمة نعم/لا
az: Bəli/Xeyr dəyəri
el: Τιμή Ναι/Όχι
eo: Jes/Ne Valoro
et: Jah/Ei väärtus
eu: Bai/Ez balioa
ka: დიახ/არა მნიშვნელობა
ru: Значение «да/нет»
sl: Vrednost Da/Ne
zh_tw: 是/否（真/假) 值

# KDbField|
source: Date
ar: تاريخ
az: Tarix
el: Ημερομηνία
eo: Dato
et: Kuupäev
eu: Data
ka: თარიღი
ru: Дата
sl: Datum
zh_tw: 日期

# KDbField|
source: Date and Time
ar: تاريخ ووقت
az: Tarix və Vaxt
el: Ημερομηνία και ώρα
eo: Dato kaj Tempo
et: Kuupäev ja kellaaeg
eu: Data eta ordua
ka: თარიღი და დრო
ru: Дата и время
sl: Datum in čas
zh_tw: 日期與時間

# KDbField|
source: Time
ar: وقت
az: Vaxt
el: Ώρα
eo: Tempo
et: Kellaaeg
eu: Ordua
ka: დრო
ru: Время
sl: Čas
zh_tw: 時間

# KDbField|
source: Single Precision Number
ar: رقم دقة مفردة
az: Tək dəqiqlikli say
el: Αριθμός μονής ακρίβειας
eo: Ununura Preciza Nombro
et: Ühe komakohaga arv
eu: Doitasun bakuneko zenbakia
ka: ერთსიზუსტიანი რიცხვი
ru: Число с одинарной точностью
sl: Število v plavajoči vejici enojne natančnosti
zh_tw: 單精確浮點數

# KDbField|
source: Double Precision Number
ar: رقم دقة مزدوجة
az: Cüt dəqiqlikli say
el: Αριθμός διπλής ακρίβειας
eo: Duobla Preciza Nombro
et: Kahe komakohaga arv
eu: Doitasun bikoitzeko zenbakia
ka: ორსიზუსტიანი რიცხვი
ru: Число с двойной точностью
sl: Število v plavajoči vejici dvojne natančnosti
zh_tw: 雙精確浮點數

# KDbField|
source: Text
ar: نص
az: Mətn
el: Κείμενο
eo: Teksto
et: Tekst
eu: Testua
ka: ტექსტი
ru: Текст
sl: Besedilo
zh_tw: 文字

# KDbField|
source: Long Text
ar: نص طويل
az: Uzun mətn
el: Μεγάλο κείμενο
eo: Longa Teksto
et: Pikk tekst
eu: Testu luzea
ka: გრძელი ტექსტი
ru: Длинный текст
sl: Dolgo besedilo
zh_tw: 長文字

# KDbField|
source: Object
ar: كائن
az: Obyekt
el: Αντικείμενο
eo: Objekto
et: Objekt
eu: Objektua
ka: ობიექტი
ru: Объект
sl: Predmet
zh_tw: 物件

# KDbField|
source: Invalid Group
ar: مجموعة غير صالحة
az: Etibarsız qrup
el: Μη έγκυρη ομάδα
eo: Nevalida Grupo
et: Vigane grupp
eu: Talde baliogabea
ka: არასწორი ჯგუფი
ru: Недопустимая группа
sl: Neveljavna skupina
zh_tw: 無效的群組

# KDbField|
source: Floating Point Number
ar: رقم فاصلة عائمة
az: Sürüşən nöqtəli say
el: Αριθμός κινητής υποδιαστολής
eo: Floskoma Nombro
et: Murdarv
eu: Koma-higikorreko zenbakia
ka: მცურავწერტილიანი რიცხვი
ru: Число с плавающей запятой
sl: Število v plavajoči vejici
zh_tw: 浮點數

# KDbField|
source: Yes/No
ar: نعم/لا
az: Bəli/Xeyr
el: Ναι/Όχι
eo: Jes Ne
et: Jah/Ei
eu: Bai/Ez
ka: დიახ/არა
ru: Да/нет
sl: Da/Ne
zh_tw: 是/否

# KDbField|
source: Date/Time
ar: تاريخ/وقت
az: Tarix/Vaxt
el: Ημερομηνία/Ώρα
eo: Dato Tempo
et: Kuupäev/kellaaeg
eu: Data/Ordua
ka: თარიღი / დრო
ru: Дата и время
sl: Datum/Čas
zh_tw: 日期/時間

# KDbProperties|
source: Could not set value of database property "%1".
ar: لا أستطيع تعيين قيمة خاصية قاعدة البيانات «%1».
az: "%1" verilənlər bazası xassəsinin dəyəri ayarlanmadı.
el: Αδυναμία ορισμού τιμής για την ιδιότητα «%1» της βάσης δεδομένων.
eo: Ne eblis agordi valoron de datumbaza propreco "%1".
et: Andmebaasi omaduse "%1" väärtuse määramine nurjus.
eu: Ezin izan da ezarri datu-baseko "%1" propietateko balioa.
ka: ბაზის თვისების "%1" მნიშვნელობის დაყენების შეცდომა.
ru: Не удалось указать значение свойства базы данных «%1».
sl: Ni bilo mogoče nastaviti vrednosti lastnosti baze podatkov "%1".
zh_tw: 無法設定資料庫屬性「%1」的數值。

# KDbProperties|
source: Could not set caption for database property "%1".
ar: لا أستطيع تعيين تسمية لخاصية قاعدة البيانات «%1».
az: "%1" verilənlər bazası xassəsinin başlığı ayarlanmadı.
el: Αδυναμία ορισμού τίτλου για την ιδιότητα «%1» της βάσης δεδομένων.
eo: Ne eblis agordi bildotekston por datumbaza propreco "%1".
et: Andmebaasi omaduse "%1" pealdise määramine nurjus.
eu: Ezin izan da ezarri datu-baseko "%1" propietateko epigrafea.
ka: ბაზის თვისებსი "%1" წარწერის დაყენების შეცდომა.
ru: Не удалось указать заголовок для свойства базы данных «%1».
sl: Ni mogoče nastaviti napisa za lastnost baze podatkov "%1".

# KDbProperties|
source: Could not read database property "%1".
ar: لا أستطيع قراءة خاصية قاعدة البيانات «%1».
az: "%1" verilənlər bazası xassəsi oxuna bilmədi.
el: Αδυναμία ανάγνωσης της ιδιότητας «%1» της βάσης δεδομένων.
eo: Ne eblis legi datumbazan proprecon "%1".
et: Andmebaasi omaduse "%1" lugemine nurjus.
eu: Ezin izan da irakurri datu-baseko "%1" propietatea
ka: ბაზის თვისების წაკითხვის შეცდომა "%1".
ru: Не удалось выполнить чтение свойства базы данных «%1».
sl: Ni mogoče prebrati lastnosti baze podatkov "%1".

# KDbProperties|
source: Could not read database properties.
ar: لا أستطيع قراءة خصائص قاعدة البيانات.
az: Verilənlər bazası xüsusiyyətləri oxuna bilmədi.
el: Αδυναμία ανάγνωσης των ιδιοτήτων της βάσης δεδομένων.
eo: Ne eblis legi datumbazajn proprecojn.
et: Andmebaasi omaduste lugemine nurjus.
eu: Ezin izan dira irakurri datu-baseko propietateak.
ka: ბაზის თვისებების წაკითხვის შეცდომა.
ru: Не удалось выполнить чтение свойств базы данных.
sl: Ni mogoče prebrati lastnosti baze podatkov.

source: expr%1
ar: تعب%1
az: ifadə%1
eu: adier%1
ka: გამოს%1

# KDbResult|
source: Unspecified error encountered
ar: صادف خطأ غير محدد
az: Qeyri-müəyyən xəta aşkarlandı.
el: Παρουσιάστηκε απροσδιόριστο σφάλμα
eo: Nespecifita eraro renkontita
et: Tekkis määratlemata tõrge
eu: Zehaztu gabeko errore bat aurkitu da
ka: აღმოჩენილია გაუთვალისწინებელი შეცდომა
ru: Произошла неизвестная ошибка
sl: Prišlo je do nedoločene napake

# KDbParser|
source: Invalid integer number
ar: رقم صحيح غير صالح
az: Səhv tam say
el: Μη έγκυρος ακέραιαος
eo: Nevalida entjera nombro
et: Vigane täisarv
eu: Zenbaki oso baliogabea
ka: არასწორი მთელი რიცხვი
ru: Недопустимое целое число
sl: Neveljavno celo število

# KDbParser|
source: This integer number may be too large.
ar: ربما هذا الرقم الصحيح كبير جدًّا.
az: Tam say çox uzun ola bilər.
el: Αυτός ο ακέραιος ίσως είναι πολύ μεγάλος.
eo: Ĉi tiu entjera nombro eble estas tro granda.
et: See täisarv võib olla liiga suur.
eu: Zenbaki oso hau handiegia izan daiteke.
ka: მთელი რიცხვი მეტისმეტად დიდია.
ru: Это целое число, возможно, является слишком большим.
sl: To celo število je lahko preveliko.

# KDbParser|
source: Unexpected character %1 in date/time
ar: حرف غير متوقع %1 في التاريخ/الوقت
az: Tarix/vaxt-da "%1" qeyri-müəyyən simvil
el: Μη αναμενόμενος χαρακτήρας %1 στην ημερομηνία/ώρα
eo: Neatendita signo %1 en dato/tempo
et: Ootamatu märk.%1 kuupäevas/kellaajas
eu: Ustekabeko karakterea, %1, data/orduan
ka: მოულოდნელი სიმბოლო %1 დროში/თარიღში
ru: Неожиданный символ %1 в дате и времени
sl: Nepričakovan znak %1 v datumu/času

# KDbParser|
source: Invalid string
ar: سلسلة غير صالحة
az: Səhv sətir
el: Μη έγκυρη συμβολοσειρά
eo: Nevalida ĉeno
et: Vigane string
eu: Kate baliogabea
ka: არასწორი სტრიქონი
ru: Недопустимая строка
sl: Neveljaven niz

# KDbParser|
source: Invalid character in string
ar: حرف غير صالح في السلسلة
az: Sətirdə səhv simvol
el: Μη έγκυρος χαρακτήρας σε συμβολοσειρά
eo: Nevalida signo en ĉeno
et: Vigane märk stringis
eu: Karaktere baliogabea katean
ka: სტრიქონი არასწორ სიმბოლოს შეიცავს
ru: Недопустимый символ в строке
sl: Neveljaven znak v nizu

# KDbParser|
source: Invalid identifier
ar: معرِّف غير صالح
az: Səhv identifikator
el: Μη έγκυρο αναγνωριστικό
eo: Nevalida identigilo
et: Vigane identifikaator
eu: Identifikatzaile baliogabea
ka: არასწორი იდენტიფიკატორი
ru: Недопустимый идентификатор
sl: Neveljaven identifikator

# KDbParser|
source: Identifiers should start with a letter or '_' character
ar: يجب أن تبدأ المعرِّفات بحرف أو علامة '_'.
az: İdentifikatorlar hərf vəya "_" işarəsi ilə başlamalıdır
el: Τα αναγνωριστικά ξεκινούν με γράμμα ή τον χαρακτήρα '_'
eo: Identigiloj devas komenci per litero aŭ '_' signo
et: Identifikaator peab algama tähega või märgiga '_'
eu: Identifikatzaileak letra batekin edo '_' karaktere batekin hasi behar dira
ka: იდენტიფიკატორები ასოებით ან '_' სიმბოლოთი უნდა იწყებოდეს
ru: Идентификаторы должны начинаться с буквы или символа «_»
sl: Identifikatorji bi se morali začeti s črko ali podčrtajem

# KDbParser|
source: Unexpected character %1
ar: حرف غير متوقع %1
az: Qeyri-müəyyən işarə %1
el: Μη αναμενόμενος χαρακτήρας %1
eo: Neatendita signo %1
et: Ootamatu märk %1
eu: Ustekabeko karakterea, %1
ka: მოულოდნელი სიმბოლო %1
ru: Неожиданный символ %1
sl: Nepričakovan znak %1

# KDbParser|
source: identifier was expected
ar: توقع معرِّف
az: İdentifikator gözlənilirdi
el: αναμενόταν αναγνωριστικό
eo: identigilo estis atendita
et: oodati identifikaatorit
eu: identifikatzaile bat espero zen
ka: მოელოდი იდენტიფიკატორს
ru: ожидался идентификатор
sl: pričakovan je bil identifikator

# KDbParser|
source: Syntax Error
ar: خطأ إملائي
az: Sintaksis xətası
el: Συντακτικό σφάλμα
eo: Sintakso Eraro
et: Süntaksi tõrge
eu: Sintaxi errorea
ka: სინტაქსური შეცდომა
ru: Синтаксическая ошибка
sl: Napaka skladnje
zh_tw: 語法錯誤

# KDbParser|
source: "%1" is a reserved keyword.
ar: «%1» كلمة مفتاحية محجوزة.
az: "%1" qorunan açar sözüdür
el: Το «%1» είναι κατοχυρωμένη λέξη-κλειδί.
eo: "%1" estas rezervita ŝlosilvorto.
et: "%1" on reserveeritud võtmesõna.
eu: "%1" erreserbatutako gako-hitz bat da.
ka: "%1" დაკავებული საკვანძო სიტყვაა.
ru: «%1» — зарезервированное ключевое слово.
sl: "%1" je rezervirana ključna beseda.

# KDbParser|
source: Syntax error.
ar: خطأ إملائي.
az: Sintaksis xətası.
el: Συντακτικό σφάλμα.
eo: Sintaksa eraro.
et: Süntaksi tõrge.
eu: Sintaxi errorea.
ka: სინტაქსური შეცდომა.
ru: Синтаксическая ошибка.
sl: Napaka skladnje.
zh_tw: 語法錯誤。

# KDbParser|
source: Error
ar: خطأ
az: Xəta
el: Σφάλμα
eo: Eraro
et: Tõrge
eu: Errorea
ka: შეცდომა
ru: Ошибка.
sl: Napaka
zh_tw: 錯誤
