Repository: KDE/kdb
Catalog: poqm/*/kdb_qt.po
Languages: ar, az, el, eo, et, eu, ka, ru, sl, zh_tw

# KDbConnection|
source: Error during starting temporary connection using "%1" database name.
ar: خطأ أثناء بدء الاتصال المؤقت باستخدام اسم قاعدة البيانات «%1».
az: "%1" verilənlər bazası adını istifadə edən müvəqqəti bağlantının qurulması zamanı xəta baş verdi.
el: Σφάλμα κατά την έναρξη προσωρινής σύνδεσης με χρήση του ονόματος «%1» βάσης δεδομένων.
eo: Eraro dum lanĉado de provizora konekto per datumbaznomo "%1".
et: Tõrge ajutise ühenduse käivitamisel andmebaasi "%1" nimega.
eu: Errorea "%1" datu-base izena erabiliz aldi baterako konexioa abiatzean.
ka: შეცდომა ბაზის სახელის "%1" გამოყენებით დროებითი შეერთების გაშვებისას.
ru: Ошибка при запуске временного соединения с использованием имени базы данных «%1».
sl: Napaka med zagonom začasne povezave pri uporabi imena baze podatkov "%1".

# KDbConnection|
source: Could not delete database. Name is not specified.
ar: لا أستطيع حذف قاعدة البيانات. لم يحدد الاسم.
az: Verilənlər bazası silinə bilmədi. Ad verilməyib.
el: Αδυναμία διαγραφής βάσης δεδομένων. Το όνομα δεν έχει ορισθεί.
eo: Ne eblis forigi datumbazon. Nomo ne estas specifita.
et: Andmebaasi kustutamine nurjus. Nime pole määratud.
eu: Ezin izan da datu-basea ezabatu. Izena ez da zehaztu.
ka: ბაზის წაშლა შეუძლებელია. სახელი მითითებული არაა.
ru: Не удалось удалить базу данных. Не указано имя.
sl: Baze podatkov ni bilo mogoče izbrisati. Ime ni določeno.

# KDbConnection|
source: Could not delete system database "%1".
ar: لا أستطيع حذف قاعدة بيانات النظام «%1».
az: "%1" sistem verilənlər bazası silinə bilmədi.
el: Αδυναμία διαγραφής της βάσης δεδομένων «%1» του συστήματος.
eo: Ne eblis forigi sisteman datumbazon "%1".
et: Andmebaasi "%1" kustutamine nurjus.
eu: Ezin izan da ezabatu "%1" sistemako datu-basea.
ka: სისტემური ბაზის "%1" წაშლის შეცდომა.
ru: Не удалось удалить системную базу данных «%1».
sl: Ni bilo mogoče izbrisati baze podatkov "%1".

# KDbConnection|
source: Could not retrieve list of object names.
ar: لا أستطيع استرداد قائمة أسماء الكائنات.
az: Obyekt adları siyahısı bərpa edilə bilmədi.
el: Αδυναμία ανάκτησης της λίστας με τα ονόματα αντικειμένων.
eo: Ne eblis retrovi liston de objektonomoj.
et: Objektinimede loendi hankimine nurjus.
eu: Ezin izan da berreskuratu objektu izenen zerrenda.
ka: ობიექტის სახელების სიის მიღების შეცდომა.
ru: Не удалось получить список имён объектов.
sl: Seznama imen predmetov ni bilo mogoče pridobiti.

# KDbConnection|
source: Could not retrieve list of table names.
ar: لا أستطيع استرداد قائمة أسماء الجداول.
az: Cədvəl adları siyahısı bərpa edilə bilmədi.
el: Αδυναμία ανάκτησης της λίστας με τα ονόματα των πινάκων.
eo: Ne eblis retrovi liston de tabelnomoj.
et: Tabelinimede loendi hankimine nurjus.
eu: Ezin izan da berreskuratu taula izenen zerrenda.
ka: ცხრილის სახელების სიის მიღების შეცდომა.
ru: Не удалось получить список имён таблиц.
sl: Seznama imen tabel ni bilo mogoče pridobiti.

# KDbConnection|
source: Could not retrieve list of physical table names.
ar: لا أستطيع استرداد قائمة أسماء الجداول الفيزيائية.
az: Fizizki cədvəl adları siyahısı bərpa edilə bilmədi.
el: Αδυναμία ανάκτησης της λίστας με τα ονόματα των φυσικών πινάκων.
eo: Ne eblis retrovi liston de fizikaj tabelnomoj.
et: Füüsiliste tabelite nimede loendi hankimine nurjus.
eu: Ezin izan da berreskuratu taula fisikoen izenen zerrenda.
ka: ფიზიკური ცხრილის სახელების სიის მიღების შეცდომა.
ru: Не удалось получить список имён физических таблиц.
sl: Seznama fizičnih imen tabel ni bilo mogoče pridobiti.

# KDbConnection|
source: Could not retrieve list of object identifiers.
ar: لا أستطيع استرداد قائمة معرِّفات الكائنات.
az: Obyekt identifikatorları siyahısı bərpa edilə bilmədi.
el: Αδυναμία ανάκτησης της λίστας με τα αναγνωριστικά αντικειμένων.
eo: Ne eblis retrovi liston de objektidentigiloj.
et: Objektide identifikaatorite loendi hankimine nurjus.
eu: Ezin izan da eskuratu objektu-identifikatzaileen zerrenda.
ka: ობიექტის იდენტიფიკატორების სიის მიღების შეცდომა.
ru: Не удалось получить список идентификаторов объектов.
sl: Seznama identifikatorjev predmetov ni bilo mogoče pridobiti.

# KDbConnection|
source: SQL statement for execution is invalid or empty.
ar: عبارة SQL للتنفيذ غير صالحة أو فارغة.
az: SQL təlimatı, icra edilmək üçün yararsızdır və ya boşdur.
el: Η προς εκτέλεση SQL πρόταση είναι μη έγκυρη ή κενή.
eo: SQL-deklaro por plenumo estas nevalida aŭ malplena.
et: SQL-lause on täitmiseks vigane või tühi.
eu: Exekutatu beharreko SQL adierazpena baliogabea da edo hutsik dago.
ka: გასაშვები SQL ოპერატორი არასწორი ან ცარიელია.
ru: SQL-выражение для выполнения является недопустимым или пустым.
sl: Ukaz SQL za izvedbo je neveljaven ali prazen.

# KDbConnection|
source: Error while executing SQL statement.
ar: خطأ أثناء تنفيذ عبارة SQL.
az: SQL təlimatının icra olunması zamanı xəta.
el: Σφάλμα κατά την εκτέλεση της SQL πρότασης.
eo: Eraro dum plenumo de SQL-deklaro.
et: Tõrge SQL-lause täitmisel
eu: Errorea SQL adierazpena exekutatzean.
ka: შეცდომა SQL ოპერატორის შესრულებისას.
ru: Ошибка при выполнении SQL-выражения.
sl: Napaka ob izvajanju ukaza SQL.

# KDbConnection|
source: Creating table failed.
ar: فشل إنشاء الجدول.
az: Cədvəl yaradıla bilmədi.
el: Αποτυχία δημιουργίας πίνακα.
eo: Kreado de tabelo malsukcesis.
et: Tabeli loomine nurjus.
eu: Taula sortzea huts egin du.
ka: ცხრილის შექმნის შეცდომა.
ru: Не удалось создать таблицу.
sl: Tvorjenje tabele ni bilo mogoče.

# KDbConnection|
source: Could not create table without fields.
ar: لا أستطيع إنشاء جدول بدون حقول.
az: Sahələrsiz cədvəl yaradıla bilmədi.
el: Αδυναμία δημιουργίας πίνακα χωρίς πεδία.
eo: Ne eblis krei tabelon sen kampoj.
et: Tabelit ei saa luua ilma väljadeta.
eu: Ezin da taula sortu eremurik gabe.
ka: უველებო ცხრილის შექმნა შეიძლებელია.
ru: Не удалось создать таблицу без полей.
sl: Ni bilo mogoče ustvariti tabele brez polj.

# KDbConnection|
source: System name "%1" cannot be used as table name.
ar: لا أستطيع استخدام اسم النظام «%1» كاسم جدول.
az: "%1" sistem adı cədvəl adı kimi istifadə oluna bilməz.
el: Αδυναμία χρήσης του ονόματος συστήματος «%1» ως όνομα πίνακα.
eo: Sistemnomo "%1" ne povas esti uzata kiel tabelnomo.
et: Tabeli nimena ei saa kasutada süsteemset nime "%1".
eu: "%1" sistemako izena ezin da erabili taula-izan gisa.
ka: სისტემური სახელი "%1" ცხრილის სახელად არ შეიძლება, გამოიყენოთ.
ru: Системное имя «%1» нельзя использовать в качестве имени таблицы.
sl: Sistemsko ime "%1" ne more biti uporabljeno za ime tabele.

# KDbConnection|
source: System name "%1" cannot be used as one of fields in "%2" table.
ar: لا أستطيع استخدام اسم النظام «%1» كأحد الحقول في الجدول «%2».
az: "%1" sistem adı "%2" cədvəlinin sahələrindən biri kimi istifadə oluna bilməz.
el: Αδυναμία χρήσης του ονόματος συστήματος «%1» ως πεδίο στον πίνακα «%2».
eo: Sistemnomo "%1" ne povas esti uzata kiel unu el kampoj en tabelo "%2".
et: Süsteemset nime "%1" ei saa kasutada väljana "%2" tabelis.
eu: Sistemako "%1" izena ezin da erabili "%2" taulako eremuetako baterako.
ka: სისტემის სახელი "%1" შეუძლებელია გამოიყენოთ, როგორც "%2" ცხრილის ველის სახელი.
ru: Системное имя «%1» нельзя использовать в качестве имени одного из полей в таблице «%2».
sl: Sistemsko ime "%1" ni mogoče uporabiti kot eno od polj v tabeli "%2".

# KDbConnection|
source: Could not create the same table "%1" twice.
ar: لا أستطيع إنشاء نفس الجدول «%1» مرتين.
az: Eyni "%1" cədvəli iki dəfə yaradıla bilmədi.
el: Αδυναμία δημιουργίας του ίδιου πίνακα «%1» δύο φορές.
eo: Ne eblis krei la saman tabelon "%1" dufoje.
et: Sama tabelit "%1" ei saa luua kaks korda.
eu: Ezin da sortu "%1" taula bera bitan.
ka: ცხრილი "%1" ორჯერ ვერ შეიქმნება.
ru: Невозможно дважды создать ту же таблицу «%1».
sl: Ni mogoče ustvariti iste tabele "%1" dvakrat.

# KDbConnection|
source: Table "%1" already exists.
ar: الجدول «%1» موجود بالفعل.
az: "%1" cədvəli artıq mövcuddur.
el: Ο πίνακας «%1» υπάρχει ήδη.
eo: Tabelo "%1" jam ekzistas.
et: Tabel "%1" on juba olemas.
eu: "%1" taula jada existitzen da.
ka: ცხრილი %1 უკვე არსებობს.
ru: Таблица «%1» уже существует.
sl: Tabela "%1" že obstaja.
zh_tw: 表格「%1」已存在。

# KDbConnection|
source: Table "%1" does not exist.
ar: الجدول «%1» غير موجود.
az: "%1" cədvəli mövcud deyil.
el: Ο πίνακας «%1» δεν υπάρχει.
eo: Tabelo "%1" ne ekzistas.
et: Tabelit "%1" ei ole olemas.
eu: "%1" taula ez da existitzen.
ka: ცხრილი %1 არ არსებობს.
ru: Таблица «%1» не существует.
sl: Tabela "%1" ne obstaja.
zh_tw: 表格「%1」不存在。

# KDbConnection|
source: Could not delete object's data.
ar: لا أستطيع حذف بيانات الكائن.
az: Obyektin məlumatları silinə bilmədi.
el: Αδυναμία διαγραφής των δεδομένων του αντικειμένου.
eo: Ne eblis forigi la datumojn de objekto.
et: Objekti andmete kustutamine nurjus.
eu: Ezin izan dira ezabatu objektuen datuak.
ka: ობიექტის მონაცემების წაშლის შეცდომა.
ru: Не удалось удалить данные объекта.
sl: Ni mogoče zbrisati podatkov predmeta.
zh_tw: 無法刪除物件的資料。

# KDbConnection|
source: Could not delete table "%1". %2
ar: لا أستطيع حذف الجدول «%1». %2
az: "%1" cədvəli silinə bilmədi. %2
el: Αδυναμία διαγραφής του πίνακα «%1». %2
eo: Ne eblis forigi tabelon "%1". %2
et: Tabeli "%1" kustutamine nurjus. %2
eu: Ezin izan da ezabatu "%1" taula. %2
ka: ცხრილის "%1" წაშლის შეცდომა. %2
ru: Не удалось удалить таблицу «%1». %2
sl: Ni mogoče zbrisati tabele "%1". %2
zh_tw: 無法刪除表格「%1」。%2

# KDbConnection|
source: Unexpected name or identifier.
ar: اسم أو معرِّف غير متوقع.
az: Gözlənilməz ad və ya identifikator.
el: Μη αναμενόμενο όνομα ή αναγνωριστικό.
eo: Neatendita nomo aŭ identigilo.
et: Ootamatu nimi või identifikaator.
eu: Ustekabeko izena edo identifikatzailea.
ka: მოულოდნელი სახელი ან იდენტიფიკატორი.
ru: Неожиданное имя или идентификатор.
sl: Nepričakovano ime ali identifikator.
zh_tw: 非預期的名稱或識別子。

# KDbConnection|
source: Could not alter table "%1" using the same table as destination.
ar: لا أستطيع تغيير الجدول «%1» باستخدام نفس الجدول كوجهة.
az: Hədəf olaraq eyni cədvəli istifadə edərək "%1" cədvəli dəyişdirilə bilmədi.
el: Αδυναμία τροποποίησης του πίνακα «%1» με χρήση του ίδιου πίνακα ωε προορισμό.
eo: Ne eblis ŝanĝi tabelon "%1" uzante la saman tabelon kiel celo.
et: Tabelit "%1" ei saa muuta sama tabelit sihtkohana kasutades.
eu: Ezin izan da "%1" taula aldatu taula bera jomuga gisa erabiliz.
ka: ცხრილის "%1" შეცვლა სამიზნედ იგივე ცხრილის მითითებისას შეუძლებელია.
ru: Не удалось изменить таблицу «%1», используя ту же самую таблицу как место назначения.
sl: Tabele "%1" ni bilo mogoče spremeniti z isto tabelo kot ciljem.
zh_tw: 無法在使用同一個表格當做目標的時候修改表格「%1」。

# KDbConnection|
source: Unknown table "%1".
ar: الجدول «%1» غير معروف.
az: Naməlum cədvəl "%1".
el: Άγνωστος πίνακας «%1».
eo: Nekonata tabelo "%1".
et: Tundmatu tabel "%1".
eu: "%1" taula ezezaguna.
ka: უცნობი ცხრილი "%1".
ru: Неизвестная таблица «%1».
sl: Neznana tabela "%1".
zh_tw: 未知的表格「%1」。

# KDbConnection|
source: Invalid table name "%1".
ar: اسم جدول غير صالح «%1».
az: Səhv cədvəl adı "%1".
el: Μη έγκυρο όνομα πίνακα «%1».
eo: Nevalida tabelnomo "%1".
et: Vigane tabeli nimi "%1".
eu: "%1" taula izen baliogabea.
ka: ცხრილის არასწორი სახელი "%1".
ru: Недопустимое имя таблицы «%1».
sl: Neveljavno ime tabele "%1".
zh_tw: 無效表格名稱「%1」。

# KDbConnection|
source: Could not rename table "%1" using the same name.
ar: لا أستطيع إعادة تسمية الجدول «%1» باستخدام نفس الاسم.
az: Eyni addan istifadə edərək "%1" cədvəlinin adı dəyişdirilə bilmədi.
el: Αδυναμία μετονομασίας του πίνακα «%1» με χρήση του ίδιου ονόματος.
eo: Ne eblis renomi tabelon "%1" uzante la saman nomon.
et: Tabelile "%1" ei saa anda nimeks sedasama nime.
eu: Ezin izan da "%1" taula berrizendatu izen bera erabiliz.
ka: ცხრილის "%1" სახელის შეცვლა იგივე სახელით შეუძლებელია.
ru: Не удалось переименовать таблицу «%1», используя то же самое имя.
sl: Tabele "%1" ni bilo mogoče preimenovati z istim imenom.
zh_tw: 無法將表格「%1」重新命名成同一個名稱。

# KDbConnection|
source: Could not rename table "%1" to "%2". Table "%3" already exists.
ar: لا أستطيع إعادة تسمية الجدول «%1» إلى «%2». الجدول «%3» موجود بالفعل.
az: Cədvəlin "%1" adı "%2" ilə dəyişdirilə bilmədi. "%3" cədvəli artıq mövcuddur.
el: Αδυναμία μετονομασίας του πίνακα «%1» σε «%2». Ο πίνακας «%3» υπάρχει ήδη.
eo: Ne eblis renomi tabelon "%1" al "%2". Tabelo "%3" jam ekzistas.
et: Tabelile "%1" ei saa anda nimeks "%2". Tabel "%3" on juba olemas.
eu: Ezin izan da "%1" taula "%2" berrizendatu. "%3" taula jada existitzen da.
ka: ცხრილის სახელით "%1" "%2-ად გადარქმევა შეუძლებელია. ცხრილი "%3" უკვე არსებობს.
ru: Не удалось переименовать таблицу «%1» в «%2». Таблица «%3» уже существует.
sl: Tabele "%1" ni bilo mogoče preimenovati v "%2". Tabela "%3" že obstaja.
zh_tw: 無法將表格「%1」重新命名為「%2」。表格「%3」已存在。

# KDbConnection|
source: Query "%1" does not exist.
ar: الاستعلام «%1» غير موجود.
az: "%1" sorğusu mövcud deyil.
el: Το ερώτημα «%1» δεν υπάρχει.
eo: Demando "%1" ne ekzistas.
et: Päringut "%1" ei ole olemas.
eu: "%1" itauna ez da existitzen.
ka: მოთხოვნა "%1" არ არსებობს.
ru: Запрос «%1» не существует.
sl: Poizvedba "%1" ne obstaja.
zh_tw: 查詢「%1」不存在。

# KDbConnection|
source: Transactions are not supported for "%1" driver.
ar: المعاملات غير مدعومة للمشغل «%1».
az: "%1" sürücüsü üçün əməliyyatlar dəstəklənmir.
el: Οι συναλλαγές δεν υποστηρίζονται για τον οδηγό «%1».
eo: Transakcioj ne estas subtenataj por pelilo "%1".
et: "%1" draiver ei toeta tehinguid.
eu: Transakzioak ez ditu "%1" gidariak onartzen.
ka: "%1" დრაივერისთვის ტრანზაქციები მხარდაჭერილი არაა.
ru: Для драйвера «%1» не предусмотрена поддержка транзакций.
sl: Transakcije za gonilnik "%1" niso podprte.

# KDbConnection|
source: Begin transaction failed.
ar: فشل بدء المعاملة.
az: Əməliyyat başladıla bilmədi.
el: Αποτυχία έναρξης συναλλαγής.
eo: Komenci transakcion malsukcesis.
et: Tehingu alustamine nurjus.
eu: Transakzioaren hasierak huts egin du.
ka: ტრანზაქციის დაწყების შეცდომა.
ru: Не удалось начать транзакцию.
sl: Začetek transakcije ni uspel.

# KDbConnection|
source: Transaction already started.
ar: بدئت المعاملة بالفعل.
az: Əməliyyat artıq başlayıb.
el: Η συναλλαγή έχει ήδη αρχίσει.
eo: Transakcio jam komenciĝis.
et: Tehinguga on juba alustatud.
eu: Transakzioa hasi da dagoeneko.
ka: ტრანზაქცია უკვე გაშვებულია.
ru: Транзакция уже начата.
sl: Transakcija že začeta.

# KDbConnection|
source: Transaction not started.
ar: لم تبدأ المعاملة.
az: Əməliyyat başladılmadı.
el: Η συναλλαγή δεν ξεκίνησε.
eo: Transakcio ne komenciĝis.
et: Tehingut ei ole alustatud.
eu: Transakzioa ez da hasi.
ka: ტრანზაქცია არ დაწყებულა.
ru: Транзакция не начата.
sl: Transakcija ni začeta.

# KDbConnection|
source: Error on commit transaction.
ar: خطأ عند الالتزام بالمعاملة.
az: Əməliyyatın saxlanılmasında xəta
el: Σφάλμα στην πραγματοποίηση συναλλαγής.
eo: Eraro dum transakcio de transdono.
et: Tõrge sissekandmistehingul.
eu: Errorea transakzioa baliozkotzean.
ka: ტრანზაქციის გადაცემის შეცდომა.
ru: Ошибка при фиксации транзакции.
sl: Napaka pri potrjevanju transakcije.

# KDbConnection|
source: Error on rollback transaction.
ar: خطأ عند التراجع عن المعاملة.
az: Əməliyyatın geri qaytarılmasında xəta
el: Σφάλμα στην αναίρεση συναλλαγής.
eo: Eraro ĉe retrotraakcio.
et: Tõrge tagasivõtmisetehingul.
eu: Errorea transakzioa atzeraka kentzean.
ka: ტრანზაქციის დაბრუნების შეცდომა.
ru: Ошибка при откате транзакции.
sl: Napaka pri razveljavitvi transakcije.

# KDbConnection|
source: Invalid object name "%1".
ar: اسم كائن غير صالح «%1».
az: Yalnış obyekt adı "%1".
el: Μη έγκυρο όνομα αντικειμένου «%1».
eo: Nevalida objektonomo "%1".
et: Vigane objekti nimi "%1".
eu: "%1" objektu-izen baliogabea.
ka: არასწორი ობიექტის სახელი "%1".
ru: Недопустимое имя объекта «%1».
sl: Neveljavno ime predmeta "%1".

# KDbConnection|
source: Column "%1" does not exist in the query.
ar: العمود «%1» غير موجود في الاستعلام.
az: "%1" sütunu sorğuda yoxdur.
el: Η στήλη «%1» δεν υπάρχει στο ερώτημα.
eo: Kolumno "%1" ne ekzistas en la demando.
et: Päringus puudub veerg "%1".
eu: "%1" zutabea itaunean ez da existitzen.
ka: მოთხოვნაში სვეტი "%1" არ არსებობს.
ru: В запросе нет столбца «%1».
sl: Stolpec "%1" v poizvedbi ne obstaja.
zh_tw: 欄位「%1」不存在於查詢中。

# KDbConnection|Extended schema for a table: loading error
source: Error while loading extended table schema.
ar: خطأ أثناء تحميل مخطط الجدول الموسع.
az: Genişləndirilmiş cədvəl sxeminin yüklənməsi zamanı xəta.
el: Σφάλμα κατά τη φόρτωση εκτεταμένου σχεσιακού σχήματος.
eo: Eraro dum ŝargo de plilongigita tabelskemo.
et: Tõrge laiendatud tabeli skeemi laadimisel.
eu: Errorea taula hedatuaren eskema zamatzean.
ka: შეცდომა გაფართოებული ცხრილის სქემის ჩატვირთვისას.
ru: Ошибка при загрузке расширенной схемы таблицы.
sl: Napaka med nalaganjem razširjene sheme tabel.

# KDbConnection|
source: Invalid XML data: %1
ar: بيانات XML غير صالحة: %1
az: Səhv XML məlumatı: %1
el: Μη έγκυρα XML δεδομένα: %1
eo: Nevalidaj XML-datumoj: %1
et: Vigased XML-andmed: %1
eu: XML datu baliogabeak: %1
ka: არასწორი XML მონაცემი: %1
ru: Недопустимые данные XML: %1
sl: Neveljavni podatki XML: %1
zh_tw: 無效的 XML 資料：%1

# KDbConnection|
source: Error in XML data: "%1" in line %2, column %3. XML data: %4
ar: خطأ في بيانات XML: «%1» في السطر %2، العمود %3. بيانات XML: %4
az: XML çəlumatında xəta: "%1", "%2" sətirində, sütun %3. XML məlumatı: %4
el: Σφάλμα σε XML δεδομένα: «%1» στη γραμμή %2, στήλη %3. XML δεδομένα: %4
eo: Eraro en XML-datumoj: "%1" en linio %2, kolumno %3. XML-datumoj: %4
et: Viga XML-andmetes: "%1" real %2, veerus %3. XML-andmed: %4
eu: Errorea XML datuetan: "%1" %2 lerroan, %3 zutabea. XML datuak: %4
ka: შეცდომა XML მონაცემებში: "%1" ხაზზე %2 სვეტი %3. XML მონაცემები: %4
ru: Ошибка в данных XML: «%1» в строке %2, столбец %3. Данные XML: %4
sl: Napaka v podatkih XML: "%1" v vrstici %2, stolpcu %3. Podatki XML: %4

# KDbConnection|
source: Could not update record because there is no master table defined.
ar: لا أستطيع تحديث السجل لأنه لا يوجد جدول رئيسي معرَّف.
az: Yazılmanı yeniləmək mümkün olmadı, çünki əsas cədvəl ayarlanmayıb.
el: Αδυναμία ενημέρωσης εγγραφής επειδή δεν έχει ορισθεί κύριος πίνακας.
eo: Ne eblis ĝisdatigi rikordon ĉar ne estas ĉeftabelo difinita.
et: Kirjet ei saanud uuendada, sest peatabel on määramata.
eu: Ezin izan da erregistroa eguneratu taula nagusirik definiturik ez dagoelako.
ka: ჩანაწერის განახლება შეუძლებელია, რადგან მთავარი ცხრილი აღწერილი არაა.
ru: Не удалось обновить запись, так как не задана главная таблица.
sl: Zapisa ni mogoče posodobiti, ker ni definirana glavna tabela.
zh_tw: 無法更新紀錄，因為沒有定義主表格。

# KDbConnection|
source: Could not update record because master table has no primary key defined.
ar: لا أستطيع تحديث السجل لأن الجدول الرئيسي ليس لديه مفتاح أساسي معرَّف.
az: Yazılma yenilənmədi, çünki o əsas cədvəlin müəyyən ilkin açarından ibarət deyil.
el: Αδυναμία ενημέρωσης εγγραφής επειδή δεν έχει ορισθεί πρωτεύον κλειδί στον κύριο πίνακα.
eo: Ne eblis ĝisdatigi rikordon ĉar majstra tabelo havas neniun ĉefan ŝlosilon difinita.
et: Kirjet ei saanud uuendada, sest peatabeli primaarvõti on määramata.
eu: Ezin izan da erregistroa eguneratu taula nagusiak lehen mailako gakorik definiturik ez daukalako.
ka: ჩანაწერის განახლება შეუძლებელია, რადგან მთავარ ცხრილს ძირითადი გასაღები აღწერილი არ აქვს.
ru: Не удалось обновить запись, так как в главной таблице не задан первичный ключ.
sl: Zapisa ni mogoče posodobiti, ker v glavni tabeli ni definiran primarni ključ.
zh_tw: 無法更新紀錄，因為主表格沒有定義主鍵值。

# KDbConnection|
source: Could not update record because it does not contain entire primary key of master table.
ar: لا أستطيع تحديث السجل لأنه لا يحتوي على المفتاح الأساسي الكامل للجدول الرئيسي.
az: Yazılma yenilənmədi, çünki o əsas cədvəlin İlkin açarının tamamından ibarət deyil.
el: Αδυναμία ενημέρωσης εγγραφής επειδή δεν περιέχει το πλήρες πρωτεύον κλειδί του κύριου πίνακα.
eo: Ne eblis ĝisdatigi rikordon ĉar ĝi ne enhavas tutan ĉefan ŝlosilon de majstra tabelo.
et: Kirjet ei saanud uuendada, sest peatabelil puudub kogu primaarvõti.
eu: Ezin izan da erregistroa eguneratu taula nagusiko lehen mailako gako osorik ez daukalako.
ka: ჩანაწერის განახლება შეუძლებელია, რადგან ის მთავარი ცხრილის ძირითად გასაღებს სრულად არ შეიცავს.
ru: Не удалось обновить запись, так как она не содержит весь первичный ключ главной таблицы.
sl: Zapisa ni mogoče posodobiti, ker ne vsebuje celotnega primarnega ključa glavne tabele.
zh_tw: 無法更新紀錄，因為它不包含主表格的整個主鍵值。

# KDbConnection|
source: Primary key's field "%1" cannot be empty.
ar: حقل المفتاح الأساسي «%1» لا يجب أن يكون فارغًا.
az: İlikn açarın "%1" sahəsi boş ola bilməz.
el: Το πεδίο του πρωτεύοντος κλειδιού «%1» δεν μπορεί να είναι κενό.
eo: La kampo "%1" de ĉefa ŝlosilo ne povas esti malplena.
et: Primaarvõtme väli "%1" ei tohi olla tühi.
eu: "%1" lehen mailako gako eremua ezin da hutsik egon.
ka: ძირითადი გასაღების ველი "%1" ცარიელი ვერ იქნება.
ru: Поле первичного ключа «%1» не может быть пустым.
sl: Polje primarnega ključa "%1" ne more biti prazno.

# KDbConnection|
source: Record updating on the server failed.
ar: فشل تحديث السجل على الخادوم.
az: Serverdəki yazı yenilənmədi.
el: Αποτυχία ενημέρωσης εγγραφής στον εξυπηερετητή.
eo: Rikorda ĝisdatigo sur la servilo malsukcesis.
et: Kirje uuendamine serveris nurjus.
eu: Zerbitzarian erregistro eguneratzea huts egin du.
ka: სერვერზე ჩანაწერის განახლების შეცდომა.
ru: Не удалось обновить запись на сервере.
sl: Posodobitev zapisa na strežniku ni uspela.
zh_tw: 伺服器上的紀錄更新失敗。

# KDbConnection|
source: Could not insert record because there is no master table specified.
ar: لا أستطيع إدراج السجل لأنه لم يحدد جدول رئيسي.
az: Əsas cədvəl göstərilmədiyi üçün yazı əlavə edilmədi.
el: Αδυναμία εισαγωγής εγγραφής επειδή δεν έχει ορισθεί κύριος πίνακας.
eo: Ne eblis enmeti rikordon ĉar ne estas specifita majstra tabelo.
et: Kirjet ei saanud lisada, sest peatabel on määramata.
eu: Ezin izan da erregistroa txertatu taula nagusirik zehaztu ez delako.
ka: ჩანაწერის ჩასმა შეუძლებელია, რადგან მთავარი ცხრილი აღწერილი არაა.
ru: Не удалось вставить запись, так как не задана главная таблица.
sl: Zapisa ni mogoče vstaviti, ker ni določene glavne tabele.
zh_tw: 無法插入紀錄，因為沒有指定主表格。

# KDbConnection|
source: Could not insert record because master table has no primary key specified.
ar: لا أستطيع إدراج السجل لأن الجدول الرئيسي لم يحدد له مفتاح أساسي.
az: Əsas cədvəldə ilkin açar göstərilmədiyi üçün yazı əlavə edilmədi.
el: Αδυναμία εισαγωγής εγγραφής επειδή δεν έχει ορισθεί πρωτεύον κλειδί στον κύριο πίνακα.
eo: Ne eblis enmeti rikordon ĉar majstra tabelo havas neniun ĉefan ŝlosilon specifita.
et: Kirjet ei saanud lisada, sest peatabeli primaarvõti on määramata.
eu: Ezin izan da erregistroa txertatu taula nagusiak lehen mailako gakorik zehaztuta ez daukalako.
ka: ჩანაწერის ჩასმა შეუძლებელია, რადგან მთავარ ცხრილს ძირითადი გასაღები აღწერილი არ აქვს.
ru: Не удалось вставить запись, так как в главной таблице не указан первичный ключ.
sl: Zapisa ni mogoče vstaviti, ker glavna tabela nima določenega primarnega ključa.
zh_tw: 無法插入紀錄，因為主表格沒有指定主鍵值。

# KDbConnection|
source: Could not insert record because it does not contain entire master table's primary key.
ar: لا أستطيع إدراج السجل لأنه لا يحتوي على المفتاح الأساسي الكامل للجدول الرئيسي.
az: Əsas cədvəlin ilkin açarının tamamınından ibarət olmadığı üçün yazı əlavə edilmədi.
el: Αδυναμία εισαγωγής εγγραφής επειδή δεν περιέχει το πλήρες πρωτεύον κλειδί του κύριου πίνακα.
eo: Ne eblis enmeti rikordon ĉar ĝi ne enhavas la ĉefan ŝlosilon de tuta ĉeftabelo.
et: Kirjet ei saanud lisada, sest peatabelil puudub kogu primaarvõti.
eu: Ezin izan da erregistroa txertatu taula nagusiko lehen mailako gako osorik ez daukalako.
ka: ჩანაწერის ჩასმა შეუძლებელია, რადგან ის მთავარი ცხრილის ძირითად გასაღებს სრულად არ შეიცავს.
ru: Не удалось вставить запись, так как она не содержит весь первичный ключ главной таблицы.
sl: Zapisa ni mogoče vstaviti, ker ne vsebuje celotnega primarnega ključa glavne tabele.
zh_tw: 無法插入紀錄，因為它不包含主表格的整個主鍵值。
